[
{"review": "\nA Terrific Movie From The Great Walt Disney Pictures.<br><br>In The World Of Zootopia,all kinds of animals live in peaceful harmony.<br><br>There is no kind of racism or violence:\" It is a perfect world where\nlove,equality and peace of mind rule\".<br><br>It is true that peace can never happen in any place in the world if\nthere is oppression,racism,inequality and discrimination.<br><br>Walt Disney Pictures clearly delivers a useful moral of\nlove,unity,integrity and peace of mind.<br><br>This Top movie also stresses on the fact that drugs are harmful.<br><br>Zootopia tells the story of a rabbit named Judy Hopps (Goodwin) who\nwants to be the first rabbit cop, so she joins the ZPD (Zootopia Police\nDepartment).<br><br>The smart and cute female rabbit plans to achieve justice in Zootopia.<br><br>This masterpiece movie is highly recommended for all kids and for every\nadult individual in the world who seek justice,freedom and peace of\nmind.<br><br>Honestly Speaking ZOOTOPIA IS INDEED A TERRIFIC WALT Disney MOVIE.\n"},
{"review": "\nA cute and smart rabbit Judy Hopps is so ambitious and intelligent.She\nwants to become a police officer. No bunnies ever before became police\nofficers in the animal world of Zootopia because they are not strong\nenough. But Judy doesn't care what other people and animals think about\nher . She wants to overcome the prejudice and bigotry that a rabbit is\nsmall and weak animal and thus is not fit to become a police officer.<br><br>She's determined to make her dream come true, but unfortunately for\nher,she faces problems. She caught a convicted Fox who has already\ncommitted a crime, and gave him the option that she can help him to\navoid jail imprisonment if only he can definitely help her in finding\nthe missing animals. As a result, the fox and the bunny become friends\nand because of the intelligence of the amazing Judy (the bunny) she\ncleverly tamed the sly fox and attracted him to do the good and to\nrefrain from doing evil especially after he fell in love with this\nyummy bunny Judy.<br><br>Zootopia is best of the best for the spectacular\ncinematography,impressive story,enchanting music and stunning acting.\n"},
{"review": "\n\"Zootopia\" is simply the best animated movie of the year 2016 because\nthe animation was terrific,the acting was mesmerizing and the plot was\nimpressively perfect.<br><br>A female bunny Judy Hopps faces discrimination from other prejudiced\nand bigoted animals who made fun of her size and could not believe her\nstrong determination to be a cop.<br><br>since Judy is brainy and has a strong will to be a successful cop,she\nmade a deal with a sly fox to get what she wants.<br><br>When the genius and the yummy bunny Judy became a policewoman,she was\nso just and confident in dealing with other animals and soon she\nreceives all the estimation from all the animals including the\npreviously prejudiced animals who underestimated it.\n"},
{"review": "\nFrom the largest elephant to the smallest shrew, the city of Zootopia\nis a mammal metropolis where various animals live and thrive. When Judy\nHopps (Ginnifer Goodwin) becomes the first rabbit to join the police\nforce, she quickly learns how tough it is to enforce the law.\nDetermined to prove herself, Judy jumps at the opportunity to solve a\nmysterious case. Unfortunately, that means working with Nick Wilde\n(Jason Bateman), a wily fox who makes her job even harder.<br><br>I am absolutely sure Zootopia Will Be Number 1 In All Countries Of The\nWorld Without Any Exaggeration.<br><br>Since This Movie is The Production Of Disney,it has to be perfect.\n"},
{"review": "\nPlot: In a city of anthropomorphic animals, a rookie bunny cop and a\ncynical con artist fox must work together to uncover a conspiracy.<br><br>This was a film that I was hoping would be good, since most trailers\ncan trick you these days but this film surpassed my expectations. Each\nof the voice actors do a wonderful job playing their characters, the\nstandouts are Ginnifer Goodwin who plays a really likable and relatable\ncharacter and Jason Bateman who plays a character that is at fist\nunlikable but manages to improve throughout the film. This is not your\ntypical kids film, it doesn't have the bathroom jokes like in most kids\nfilms. The script is smartly written and uses the message effectively\nunlike others which beats you over the head with theirs.<br><br>Zootopia is one of my favorite films of the year, if you haven't seen\nit, give it a chance it's not your typical kids film which is what I\nlike, I just wish more of them were like this.\n"},
{"review": "\nIt's rare to find a movie that fails in one category but pulls itself\nup in another, only to cycle through this pattern many times over.\nZootopia feels like it's trying to pull itself up until it adds another\nplot point into the film.<br><br>So my main issue with the movie is that it ties up it's plot-points too\nquickly near the end. Like, it resolves the mystery, Weaselton, Mr.\nBig, and Nick and Judy hating each other in about 10 minutes.<br><br>The action scenes were all good, the train scene being a genius scene.\nThe issue is the movie feels it needs to add something to the plot\nwhich doesn't do much to the film to put in another scene, like how we\nhave to have a panther go savage just so we get a chase scene in the\njungle.<br><br>The issue holds true for not any other area of the film. There's also\nthe villain's motivation, and if you haven't seen YMS, that motivation\nis \"I'm really really racist\". It would have been nice for Bellwether\nto be developed on more instead of coming in and having no reason\nexcept being racist for being evil.<br><br>All in all, Zootopia does have a lot of good things. The music is good,\nthe action scenes are fluid, the characters are great, I loved the\nworld, but the villain killed the movie for me. I can find enjoyment in\nthis, but it's not the best. Watch it with some friends, or alone if\nyou just love Disney. It's a good film, but it could be better.\n"},
{"review": "\nStupidity took this movie down while the premise still had some allure\nas being somewhat of a modern-day \"animal farm\"but sadly that wasn't\nthe case here.<br><br>It is certainly not a classic because it's build to much in to today's\nstandards and contains the same elements as a lot of today's movies\nlike feminism,racism and sexism.<br><br>Other factors that are connected to theses elements are not so much\nhighlighted like religion or social structures within this society. It\nwants to preach diversity but gives a one-sided view to the story and\ngives all kinds of awkward messages doing so.<br><br>All the focus was on the bunny and the rest of the characters seem to\ntag a long to make sure everyone is better in the end by meeting her\nbecause she is such an inspiration.It reminded me a little of the\n'Rey\"character in\" the forge awakens\"but than to a lesser extent.A\n\"close to Mary Sue\" character basically.<br><br>I wanted more entertainment out this and also a story that served all\nthe people and not the few \"hot topics\"that are only important for a\ncouple of years.I think that with the passing of time the movie will\nloose momentum<br><br>and that it is not the timeless piece that people said it was.<br><br>The Shakira song was terrible and did not fit the movie at all and the\nanimation was \"acceptable\".I had a few laughs but not nearly as many as\ni get from watching a 20 minute episode of Southpark.<br><br>I was disappointed by it but by looking at the raving reviews realized\nI pretty much stand alone in this.<br><br>It's not bad.....just blatant PC.<br><br>Nice bunny,but no bugs!<br><br>Fox this!\n"},
{"review": "\nA cute female rabbit becomes a police officer and is instantly the best\nofficer the world has ever seen - surpassing all of her dumb male co-\nworkers who belittle her for being just a cute dumb bunny. The film\nthen descends into a commentary on racial issues as the rabbit says\nthat a bunch of predators may be attacking people as \"its in their DNA\"\nand the media and politicians whip up mass hysteria to control the\npeople (ok, that part is pretty valid). The rabbit then learns her\nlesson about how it's wrong to call out dangerous criminals if they're\nall from the same race, and that it was really the government\nmanipulating the predators into being evil.<br><br>The sloths were pretty funny, though.\n"},
{"review": "\nI enjoyed this movie far more than i expected to.<br><br>Things i liked.<br><br>The relationship between judy hopps and nick wilde was really special\nand i enjoyed watching their interaction and growing friendship, they\nare both as heroic and smart as one another and although judy is this\nadventurous and outgoing go getter type of character for a few brief\nscenes she also had an emotional side i think it was delivered with\ngreat balance. I take zero pleasure admitting tears were in my eyes\nthroughout this movie.<br><br>The humour although present throughout was never shoved down your\nthroat which lead to a nice upbeat and colourful atmosphere and that's\nnot to mention all the great design decisions behind the world created\nhere. For example Ergonomics with giraffes in mind e.g a funnel to\ndeliver a drink from ground level to giraffe height and small doors for\nmice. People should watch this movie for the world alone.<br><br>I could continue to shower this gem with praise but instead i'll list\nthe things that bothered me about this film, the first thing is that\nthe film was too short like no really i wish this film lasted an hour\nor so longer, the plot seems incredibly rushed at the end i never saw\nthe plot twist coming and didn't predict the direction the film would\ngo down but i feel it's because the culprit behind it all has come and\ngone within 5 minutes is arrested there's no build up or tension in the\nuncovering of the secrets behind the commotion which is a shame. I also\nfeel like the chief of police was a relatively poor character and most\nof the characters in the film could do with more fleshing out.<br><br>All things said and done go watch this it is great.\n"},
{"review": "\nZootopia is Disney's latest propaganda piece for the fascist police\nstate. They don't even bother to be subtle any more; nothing is left to\nthe imagination. It's all here - the 99 percent vs the one percent,\ncops who just want to serve and protect you (and BTW they're definitely\nNOT serving the one percent), and ubiquitous public cameras that help\nsolve crimes. And the punch line? The one percent are really your\nfriends - it's those ingrate 99-percenters who are the real criminals.<br><br>This film is wonderful way to encourage impressionable young children\nto conform into little statist robots who will gladly empty their minds\nand hearts to serve as a cog in the machine of the modern lie.<br><br>And now, a message from your master...\n"},
{"review": "\nBright, bubbly, breakneck: all defining characteristics of Disney's\nlatest animated adventure. Sanctimonious, serious, seldom funny: other\nkey traits that suffocate this family film until there's very little\nleft to enjoy. With multiple ecosystems and a plethora of cultural\nsubsets \u0096 mirroring our own society wouldn't you know \u0096 the\nanthropomorphic animal-world is conceptually interesting and\nbeautifully animated, but the story told within this universe is\ndisappointingly dull. The simple predators-and-prey-living-together\nplot device should've been ripe for subtle metaphors amongst zippy\naction and constant laughs, yet the film's themes \u0096 breaking down\nstereotypes, looking past race, being inclusive \u0096 are hammered home so\nheavy-handedly it feels like you're getting in trouble. A major issue\nis the lack of humour (or more accurately: successful humour) which,\nsave for a truly hilarious sloth-centred sequence that had me in tears,\nis woefully misjudged and/or drowned out by the persistence of shoving\na point down our throat. The muddled tone makes for a confusing viewing\ntoo; the unapologetic innocent nature of proceedings suggests this is\naimed squarely at the toddler demographic, yet the Godfather and\n'Breaking Bad' references are directly at odds with this. The\ninfectiously optimistic bunny at the movie's heart, Judy Hopps\n(Ginnifer Goodwin), is a sweet and likable protagonist, however the\nmischievous fox who partners with Hopps, Nick Wilde (Jason Bateman),\nhas more depth and charisma. A lower-rung Disney effort with a\ngratingly obvious agenda, Zootopia hints at brilliance but\nfrustratingly falls way short.\n"},
{"review": "\nA great example of how didactism bores rather than inspires,\nregurgitates rather than re-imagines. There's a clear political\nmessage, and the unabashed way which it is presented won't change any\nminds, but at the least may spark political debate. Though its singular\ntreatment preaching the current \"hip\" left-wing social platforms\nwithout nuance does nothing to elucidate any new ideas or attempt to\nshed new truths on issues that allow people to re-evaluate their\ncurrent ideological stances. As such, its effect is similar to that of\nthe person talking politics at the cocktail party who relies on volume\nrather than substance in order to bolster their (or more accurately\ntheir party's) talking points.<br><br>All in all, though there are some witty scenes and stereotypical\nromance &amp; coming of age story lines, the overpowering pedantic verbal\ndiarrhea exposes it as a thinly veiled political commercial rather than\na great piece of art. The ratings, therefore, represent the extent to\nwhich the audience agrees with its sermon rather than recognizes its\ndegree of unbiased (with respect to 21st century American politics)\naesthetic merit.\n"},
{"review": "\nI thought that Disney couldn't get any better, but with Zootopia, yeah.\nThe characters were awesome from Nick Wilde to Judy Hopps (etc.). It\ngave this movie a more fun and positive charm. This movie also had good\nvoice acting like Jason Bateman as Nick, I couldn't see anybody be\nvoice acting Nick. This movie had some negative vibes like racism.<br><br>And Disney hid those messages very limited but well. The animation was\ngreat and you can tell it's advancing. This movie was good and that's\nit. This movie could be the start of the evolution of the modern\nDisney. And it's amazing definitely recommend seeing this in a theater\nor rent on Hulu or Redbox.\n"},
{"review": "\nThis was an average movie. The plot of the movie was clever and took\nseveral turns that kept the movie from becoming too predictable.\nHowever, there were a slew of underlying messages throughout this\nmovie. The biggest subliminal message that I noticed in the movie was\nthrough the character of the fox. He was depicted as someone who could\nnot help the situation that he was in because of something that\nhappened to him when he was younger. I question this message and I\nwonder, besides American culture pushing this idea, if there is any\nreason to why this has become a prevalent idea of our culture. I also\nwonder what effect this message has on the young viewers who watch this\nmovie.\n"},
{"review": "\nAnimals like human live in this movie's would. They can speak a word\nand have their society. The world is called \"Zootopia,\" it means a\nUtopia. Because there is no discrimination and safety. And fresh-eating\nanimals and plant- eating animals help each other. That is to say they\nlive together. This is just a utopia. But an accident happens. Then it\nthreatens this world's peace.<br><br>This movie describes the present state of affairs in America.\nEspecially it is about the discriminations of races or sexuality so on.\nAmerica think own country is the best in the world, but there are a lot\nof discriminations in the American society. Fresh-eating animals means\nthe strong like white people or man. Plant-eating animal means the weak\nlike color people or woman. This movie is so interesting, because one\nof plant- eating animals doesn't accept the utopia, which is that And\nfresh-eating animals and plant- eating animals live together. And the\nanimal tries to exclude fresh-eating animals. The weak never forget\ntheir own sad past, which is there is discrimination.\n"},
{"review": "\nZootopia is an easy movie to describe. That's neither a compliment nor\na criticism, but for the most part this is a pretty straight forward\nmovie. It's about an underdog who rises up to the top (after facing\nmany difficulties, of course); we follow this underdog - Hopper - as\nshe investigates the case of a missing person - a case which get larger\nand larger as the movie goes on. It follows a very standard formula\n(the storytelling technique is nothing more than the cop finds the\nfirst clue, which leads to second clue, which leads to third clue, etc,\nuntil eventually they find the big bad villain). It probably sounds\nfamiliar as this is the basic storyline to most detective movies,\nespecially animated ones. But instead of conforming to complete\nconventionality as you might it would, Zootopia boosts itself by adding\nin some refreshingly new ideas for such a movie. It's a movie with a\nvaluable message laid out throughout, about not stereotyping or\nlabelling people, and looking past outward appearances. Although it\ndebatable gets a little too preachy at times, you still have to commend\nthe movie for trying to teach the younger end of the audience a very\nvaluable lesson.<br><br>The movie never quite hits any of those belly-laugh moments that you\noften find in a Pixar movie (although one particular scene with a sloth\nis hilarious), but the humour is good enough to keep older audiences\nentertained, although most of the humour would certainly work better\nwith a child. The voicing casting is on-point and the movie never\nreally gets dull, so this is sure to entertain all of the family - just\nas an animated movie should do.\n"},
{"review": "\nByron Howard and Rich Moore direct this animated treat from the Walt\nDisney Studios. Zootopia is a metropolis of mammals living and thriving\nin spite of their various sizes, persuasions and genus. A melting pot\nwhere animals go about life in their particular neighborhoods. Of\ncourse, there is the biggest of the large and tiniest of the smaller\nanimal citizens. There is also the tough and rough; meek and mild\nsharing a very special habitat. Sometimes bad things happen and push\ncomes to shove. An upbeat and a little bit sassy, Judy Hopps (Ginnifer\nGoodwin), becomes the first bunny on the police force comprised of the\nbiggest and toughest. Judy is optimistic enough to try and crack one\nthe biggest cases troubling the department. She is bound and determined\nto prove herself, even if she has to partner up with a scam-artist fox,\nNick Wilde (Jason Bateman).<br><br>This is a fun movie for all age of audience. A little rude humor, but\nplenty of comedic action. This one is good enough, you'll want to buy\nyour own copy. Cinematography is top notch as to be expected.<br><br>A very talented group of folks lend voices to the other characters:\nIdris Elba, J.K. Simmons, Tommy Chong, Shakira, Octavia Spenser, Bonnie\nHunt, Jenny Slate, Maurice LaMarche and Raymond S. Persi.<br><br>A pleasant soundtrack features music from the likes of R.E.M., Eric\nCarmen, Shakira and Winston Marshall.\n"},
{"review": "\nAnd just when you thought graphics couldn't get any better, out comes\nZootopia.......<br><br>The vote of 9 is not because this movie is brilliant in the leagues of\nsay the IMDb top 50 but because of its heart. I think 2 stars will be\njust for that beautiful song 'Try Everything' by Shakira.<br><br>The colours are absolutely dazzling. I was surprised because I had left\nmy monitor in my regular (for internet/text) dim/dull setting and I\nthought I had enabled the 'movie' mode where it spruces things up. I\nenabled that too, and boy was I in for a treat.<br><br>The main character is a rabbit who wants to be a cop in a world where\nthe cops are all the large animals, and she would become the first ever\nrabbit to become a cop. And the story is about the unusual alliance she\nforges with a wily fox to help her in her adventures in zootopia.<br><br>The voice actress is Ginnifer Goodwin (Big Love). I remember her\npositivity and big heartedness from then. And that is what you get here\ntoo. A lot of the mannerisms of the rabbit they have taken from\nGinnifer. And the rabbit itself is sooo gorgeously beautiful. She had\nthe most beautiful eyes I have ever seen in my life! <br><br>Zootopia - They have really gone out and developed a whole world for\nthis movie. You keep seeing tiny tiny surprises all the time. The\nattention to detail is fantastic.<br><br>Though there was one thing (sort of like the elephant in the room),\nthat they really avoided. What do the carnivores eat? Because even\nchickens and cows are citizens, what is then left to eat? I saw them\neating things like ice-cream, coffee, etc. But what do they actually\neat?? <br><br>This movie is highly recommended. You won't be disappointed.\n"},
{"review": "\nMy wife and I enjoyed this movie, we viewed it at home on DVD from our\nlocal library.<br><br>The premise is that this animal society has been able to overcome the\nnatural evolutionary tendency of Predators hunting and killing Prey. As\na result animals of all types live in harmony.<br><br>A young rabbit grows up to believe anyone can strive to become anything\nif they are willing to work hard enough for it. Voiced excellently by\nGinnifer Goodwin, Judy Hopps is the young rabbit that grows up and\nenters training to become a police officer. She is small but eventually\nmakes up for her shortcomings with cunning and determination.<br><br>She graduates first in her class but is disappointed to be assigned\nparking meter duty on her first day. All the others are assigned in\ngroups to look for 14 mysteriously missing animals.<br><br>Still the investigative instincts kick in and she gets a lead that\neventually solves the mystery, the dastardly assistant mayor was\nrunning a Walter White type of processing to produce a blue substance\nextracted from flowers that would cause Predators to revert to their\ninstinctive behavior.<br><br>It is all very well done, and very interesting movie in spite of being\nanimation. The other most interesting role was Jason Bateman voicing\nNick Wilde, a Fox who against his will ends up being Judy's sidekick in\ntracking down the mystery of the missing animals.\n"},
{"review": "\nThis movie is great for all ages. We can each see a little piece of use\nin each character and love to see how they develop. This movie comes at\na great time when the issue of race and ethnicity has become a hot\ntopic and can be clearly examined through the different animals and\nprejudices each suffers. Its really inspiring to see how each animal\ncan use their strengths to bypass their weaknesses and come out on top.\nIts also really great to see so many opposing types of animals working\ntogether for a common goal, even when they meet at an impasse. This\nmovie could teach kids a lot about working together and remind adults\nthe importance of open mindedness and acceptance.Donald Trump could\nlearn a little something from this movie.\n"},
{"review": "\nWhile this is definitely a kids movie, its one with a good message,\neven though it is delivered pretty heavily handed. A young bunny\ndecides she wants to become the first bunny cop in \"Zootopia\", a large\ncity where predators and prey get along. But, as in most movies, not\nall is as it seems. As I mentioned before, like most Disney movies,\nthis one has a moral message, but its iffy if the younger kids will\ncatch on. This ones, delivers the message that profilying an individual\nand judging someone for what they are or look like is wrong. This\nmessage is laid on pretty thick at times. It also hints that those in\npower, are in fact always hiding something, or at the very least aware\nof certain things that are going on and do what they have to to keep\nthem under wraps. If the kids are old enough to understand the message\nin this movie, sit down and talk about it with them. This may be a good\nidea, even if the young ones are too young to understand.\n"},
{"review": "\nImagine a world where all the animals live freely. But do not picture\nthem barking or howling. They are walking, well-dressed and paying\nrents in a so organized system that it even includes a Mayor. This\nwhole idea is developed in Disney's new movie, Zootopia. In this world\nof animals behaving like humans, there is a bunny that stands out for\nher life goals. Avid defender of animal rights, Judy Hopps dreams about\nbeing a police officer to create a better city. The only problem is a\nbunny has never done this before. Small and cute, Juddy defies\nstereotypes and becomes the first police officer of Zootopia. Despite\nher great efforts, Judy only seems to be considered for minor tasks as\ntraffic officer. This will change when she meets Nick Wilde, an\nunderrated smart fox that becomes Judy's main companion in the\nadventures that eventually evolve in a story full of action, mistakes\nand a sensible moral. <br><br>Zootopia is a movie that keeps Disney's old formula: sweetness. The\ncharacters are well built, so much you can connect to them form the\nbeginning. The plot is consistent yet full of lessons easy to pick out\nfrom a master script. If decades ago you were that kid who watched\nAladdin and had the time of your life, go watch this movie. It will be\nan hour of your life you will never regret.\n"},
{"review": "\nDamn Disney has found its magic. it's by far the best animated film\nI've seen recently. It's dazzling non-stop fun with a charming smart\nplot. The story is a about bias and understanding. You probably think\nthat's old? Well the way it's done is really fresh and funny. You'll\njust enjoy the fun and funny while and its message is timeless. The\nonly thing I thought could be better was the ending. But this is minor\ncompared with the innovation and fun of the movie. Maybe the movie\nachieved so much that it raised your expectation for a better ending,\nthat says how good it really is. This is one movie that I'll buy my own\ncopy. Highly recommend this gem.\n"},
{"review": "\nDisney's \"Zootopia\" is an amusing and action-packed addition to their\nlong history of animated classics. However, at times, the message of\nthe movie does start feeling heavy-handed. We got it the first three or\nfive times: you can do or be anything you want as long as you believe\nin yourself and go for it. There's also nothing quite like a wholesome\nhalf-dressed pop star telling our children to \"Try EVERYTHING\", right?\nAside from those two gripes, a great vocal cast and well-placed humor\nbring everything together quite nicely.<br><br>\"Zootopia\" is rated PG for some thematic elements, rude humor and\naction. Judy Hopps is bullied by her classmates, which might disturb\nyounger viewers or ones who are victims of that sort of abuse.\nChristians will be offended by the use of God's name in vain in a\ncouple of scenes as well. Judy and Nick visit a nudist colony where\nanimals don't wear clothing. The sequence might stir up some questions\nabout what exactly a nudist colony is.\n"},
{"review": "\nIt's the first time that i want to write my opinion in a movie. When i\nstarted to watch the movie, i said to myself well,it's another cute\nanimation movie. After i finished watching the movie, i didn't even\ndare to shutdown my lap before writing a review. When we move from\n\"school life\" to \"real life\", we fail depressed because the ugly face\nof life starts to be obvious. Sometimes we accept that we can't really\nchange the world. Everything around us enter this black idea to our\nminds with all our stresses and fears. Then we watch movies like\n\"Zootopia\", listen to true stories of هnspiring people or even watch\nTED talks. These kind of flashes which bring hope to our daily lives.\nThey tell us that if we have a great will, then anybody can be\nanything.\n"},
{"review": "\nZootopia is an incredible movie, it is one of my favorite movie's of\nall time. Zootopia is fun for kids to watch and is filled with loads of\njokes for grown ups to. Zootopia is a magical movie that changed my\nlife forever. It is just so clever, and after watching is time after\ntime you just notice more and more hidden jokes and hidden plots each\ntime you watch it.<br><br>Zootopia is a great to watch with you're family and it is suitable for\nkids of all ages, so what are you waiting for quit reading this review\nand start watching this amazing movie if you haven't watched it\nalready.\n"},
{"review": "\nFor the first 45 minutes I give it a 9/10, for the remaining a solid\n5/10 (i.e. typical Hollywood animation quality).<br><br>Also, not for kids under 10 years old, it has some scary scenes.<br><br>The first 45 min of the film are good for adults, less so for kids. The\nremaining isn't good for either one, it like a deflated balloon.<br><br>For some reason, the first half of the movie managed to pass Disney\ncensorship and rigid mentality, and offer some spicy jokes that will\nplease adults. But what you see in the trailer, only represents the\nfirst half time.<br><br>So leave your 5 years old at home, go in 'matinee' for special theater\nprice, and leave at the 60 minutes mark with no regrets. At least,\nthat's what I did.\n"},
{"review": "\nIn a city of anthropomorphic animals, a rookie bunny cop and a cynical\ncon artist fox must work together to uncover a conspiracy. The only\nproblem i found with Zootopia is that it was kinda humorless i mean i\nchuckled twice but that's it but i think they wanted to focus more on\nthe characters instead of the laughs and with characters like Judy and\nNick Disney proves why they are just so awesome and why they make great\nmovies. The way the movie ends also shows a 2nd part is coming so i\nhope they do it this is an animated movie that both kids &amp; their\nparents will enjoy it's smart, it has action and even tho there isn't\nthis big Disney humor the film works thanks to it's characters alone.\n10/10\n"},
{"review": "\nZootopia seems like an overused concept and was extremely predictable.\nIt felt too much like a cliché and could have used a revised story to\ndeliver the same clear message. Although Disney made their message\nclear and simple, it was practically meaningless because it was just\nanother movie with Anthropomorphic animals. Also, the characters were\nnot likable to the extent of say Mickey Mouse (and friends), Mulan,\nTimon, Pumba, Vanellope, Baymax, Olaf, and other beloved Disney\ncharacters. I had no feelings for this film's characters at crucial\nmoments of the film, unlike the characters above in their respective\nfilms. In other words, the connection between the film and the audience\nis lacking. On all other fronts, such as animation, music, and more,\nDisney does a great job at exposing the audience to the world and\nculture of Zootopia but failed to engage my interest.\n"},
{"review": "\nWhen I watched Zootopia's Trailer I was not convinced I don't know but\nIt looked so boring to me. But when I saw the whole movie I was\nliterally shocked....<br><br>It was damn amazing and it turned out to be one of the best animated\nmovies ever. As in the terms of Story it was good in concept it was\nalso good, Screenplay damn good.<br><br>I loved all of the character Judy Hobbs, Nick Wilde, Duke Weaselton and\n\"Mr. BIG\" all of them were awesome.<br><br>It has something which connects all type of audiences with it. Overall\nan awesome adventure can't wait for Sequel.\n"},
{"review": "\n\"Zootopia\" is simply the best animated movie of the year 2016 because\nthe animation was high quality,the acting was mesmerizing and the plot\nwas impressively perfect.<br><br>A female bunny Judy Hopps faces discrimination from other prejudiced\nand bigoted animals who made fun of her size and could not believe her\nstrong determination to be a cop.<br><br>since Judy is brainy and has a strong will to be a successful cop,she\nmade a deal with a sly fox to get what she wants.<br><br>When the genius and the yummy bunny Judy became a policewoman,she was\nso just and confident in dealing with other animals and soon she\nreceives all the estimation from all the animals including the\npreviously prejudiced animals who underestimated it.\n"},
{"review": "\nIt has gotten to the point where I don't even really need to know what\nthe film is about. If it's a Disney film, I feel pretty safe going to\nwatch it.<br><br>But this time, I knew about the story of Zootopia and was excited to\nsee it. <br><br>I was not let down.<br><br>I love that the animation in these Disney movies is always top notch,\nfull of detail down to the smallest things including hairs and scars,\nvibrant, beautiful colours and the voicing talents is always amazing;\nyou might not know the actors but they always seem to fit the roles.<br><br>The story is brilliant as usual \u0096 an entertaining buddy cop comedy with\na little drama thrown in - funny and full of emotion, both for adults\nand for kids, something Disney seems to do with all of their movies\nflawlessly.<br><br>If you love all the previous Disney movies, chances are you're going to\nlove this!\n"},
{"review": "\nDisney's \"Good Dinosaur\" was a setback to the company's overall good\nrating but this movie was a really well-made movie. Made me laugh a lot\nof times. It also features a song from Shakira (don't judge by the\nsinger, hear it first) called Try Everything... I am addicted... Sure\nsuggest it... Good graphics, makes little kids laugh and also teaches\nthem, TRY EVERYTHING Song lyrics ***SPOILER ALERT*** I won't give up,\nno I won't give in Till I reach the end And then I'll start again\nThough I'm on the lead I wanna try everything I wanna try even though I\ncould fail I won't give up, no I won't give in Till I reach the end And\nthen I'll start again No I won't leave I wanna try everything I wanna\ntry even though I could fail\n"},
{"review": "\nIn a city of anthropomorphic animals, a rookie bunny cop and a cynical\ncon artist fox must work together to uncover a conspiracy.<br><br>I hope I don't come off as a detractor for my 7 vote. From what I hear,\nthis is now the greatest Disney cartoon ever, surpassing \"Frozen\" as\nthe greatest Disney cartoon ever. But I don't know if I would quite go\nthat far. This one seemed too dark at times, and the message got\njumbled -- it was clearly an anti-racist message, but there was still\nthe underlying theme that \"people\" had a nature to overcome. Heck, look\nat the sloths.<br><br>But there is a lot of potential here with the world they have built.\nSequels and spinoffs seem likely, and possibly a television show.\nAlthough not a perfect film, it is a giant undertaking that really\ndeserves plenty of respect and more from the characters.\n"},
{"review": "\nWe enjoyed Zootopia. The story line was good, the dialog was good,\nthere were a lot of things to laugh at, and the graphics were over the\ntop.<br><br>The only problem we had was we thought \"Zoo\" and \"Disney\" would promise\na video that our six-year-old would enjoy. But this was way over his\nhead, and he is an articulate and smart little guy.<br><br>We were trying to figure out who the target audience was. It didn't\nseem to us that kids under 10 would get that much out of it. Ten to\ntwenty year-olds might be bored with it. Adults would enjoy it for the\nreasons listed above, but in that case it would make sense for it not\nto be animated.<br><br>This isn't the first movie we felt the same about recently. We felt The\nGood Dinosaur hit the same notes.\n"},
{"review": "\nZootopia is very refreshing movie. Disney's are mostly creating movie\nwith princesses and that kind of stuff but in this movie once more they\ntried something new. In this movie everything is good as always as\nexpected from Disney except songs I think this movie songs are not as\ngood as in other Disney movies. So, besides this everything is great.\nIn the movie they tried to show whatever humans do that are doing by\nanimal means human are not there only animals and animals are\npretending to be human. So they very nicely put everything all together\nand show it as what they are. As giraffe, rat, lion, sheep, rabbit\netc., predators, non-predators working together that the best part for\nme and I really think that director also take too much time how to put\nall of them together. The movie starts with rabbit want to become\npolice officer before this no one in rabbit ever become police officer\nso they showed it as challenge. So, after she cleared the police\nacademy exam she joined the police force as in police force they also\nunderestimated her and her boss did not give her the job what she like\ninstead she got the meter maid job. So, in the city some people are\nmissing somehow she got the job for finding those people. Then real\nstory of the movie starts and you have to watch this movie. At last one\nmotto dialogue I like which we can also use in our life \"Anyone can be\nanything\".\n"},
{"review": "\nThere are things I love about Zootopia, as this movie is really good\nabout hitting the right marks. Idris Elba voice-work? Check. Relevant\nand funny social commentary on race and contemporary race relations?\nCheck. AN EXTENDED GODFATHER JOKE?!? Super check! Heck even the size\ndifferences between the products and appliances the animals use and the\nway they are integrated together is pretty genius. And ohhhhhh the\nlittle details in the animals like the way the wolves cock their heads\nti the side when confused is great!! So where does this movie mess up?\nFor one thing it does the common kid movie trope of having irrelevant\nemotionally manipulative scenes complete with sad music for no reason\nother than to try to make the audience feel upset. There are some\npretty big plot holes, like how did they not hear the wolves howling in\nthe panther scene? How did they cut in front of the entire DMV? Also\ntowards the end the movie seems to give up and just give away all the\nremaining mysteries as easily as it can in the narratively weakest way\npossible. But overall this movie is funny, decently animated, and a lot\nbetter than your average kids movie. I give it a 7.5 out of 10 and\nrecommend people to definitely check it out.\n"},
{"review": "\nGreetings from Lithuania.<br><br>\"Zootopia\" (2016) is by far the best animated movie i have seen in\nmany, many and (did i just said MANY) many moons. Script is brilliant.\nDirecting is on the spot and perfectly matched the brilliant script,\nwhich has many references to classic movies / shows / or some pop\nculture references, which youngest audience members probably won't be\nable to understand, but adults will be in nirvana watching this\nbrilliant animation. Voice acting was also superb - there aren't\nsuperstars in every role, but that isn't a letdown, because every voice\nin here is brilliantly matched to the character, not the other way\naround. And there is a sequence with Flash - a killer scene.<br><br>Overall, i do not know what other animated masterpiece should be born\nin the rest of 2016 that would claim Oscar for best animation in next\nyears Oscars. This is a big winner, which i think can easily gain\nnomination for the best original screenplay. \"Zootopia\" is colorful,\nsuperbly funny, excellently paced and amazingly written animated movie\nwhich is easily my favorite movie so far this year. Brilliant stuff.\n"},
{"review": "\nThis movie was absolutely amazing. Everything about it was so perfect.\nI love how this movie is something that adults can enjoy and appreciate\n-- it's not just some superficial kids cartoon, it's genuinely deep and\nintricate. Something I love so much above everything else that was\namazing about this film is the moral that relates so much to what's\ngoing on in the world now, but is also universal. The moral of this\nfilm is unity, acceptance, tolerance, anti-racism, anti-sexism, doing\nwhat is right, resilience, respect, challenging assumptions,\npersistence, equality, and that we are all ultimately the same and are\none. This movie was beyond anything I'd imagined it to be. I had heard\nsome great stuff about it and decided to watch it and I'm so glad I\ndid. Kids will have fun watching this movie and learn valuable morals.\nAdults, on the other hand, will immensely enjoy watching this movie,\nwill appreciate it for what it truly is and will understand its real\nmeaning. This movie is just absolutely amazing, the best I've seen all\nyear! Please watch it, you will not be disappointed.\n"},
{"review": "\nThe animal city of Zootopia feels absurdly real. With plenty of golden\njokes and a good positive message, Zootopia has that kiddie feel while\nmaintaining its adult references.<br><br>One of the scenes when Judy Hopps (Ginnifier Goodwin) visits Nick Wilde\n(Jason Bateman) under the bridge is very powerful while realistic at\nthe same time.<br><br>Adding to the movie is a great message, which you should not judge\npeople by their race, age and height etc.<br><br>10/10 for great plot, message, acting and a great song to finish it\noff! Try everything!<br><br>Zootopia is set to be the number 1/2 animated film of 2016!\n"},
{"review": "\nWhen it comes to being a parent, part of the deal is to watch kids'\nfilms. Sometimes this can be a painful experience - let's just say that\nmy kids and I differ radically in our assessment of Alvin and the\n$*&amp;^£!*ing Chipmunks. On other occasions, however, the experience can\nbe joyful. I went into this film with low expectations, and\nunexpectedly had a ball. I honestly found it laugh-out-loud funny, and\nso did my kids. Moreover, we often laughed at the same scene for\ndifferent reasons. My kids have never seen the Godfather, for instance,\nand neither have they (yet) had to deal with a government department\nwhose speed of service would be improved by replacing everyone with\nsloths - but there were elements in these scenes which worked for them\nas well as the bits that worked for me. It is very difficult to produce\na film that really is for everybody, but this is one of the very best.<br><br>To be sure, the \"moral lesson\" is clichéd and obvious, many of the\ncharacters were simple stereotypes, and the plot twists were more than\na little predictable. Such things matter little to kids, however; and I\ncan live with them when things are handled with zest and panache. The\naction is fast-paced, the acting first-class, the animation\nstate-of-the-art - and the sight-gags are both brilliant, and scattered\nin such profusion that you probably don't have time to catch them all\non one viewing. All in all a wonderful film.\n"},
{"review": "\nWords can't describe how amazing this movie was. I watched it for the\nfirst time just yesterday and it was so cute and adorable, not to\nmention hilarious. As with any Disney movie, all the references for an\nolder audience were much appreciated. Especially all the Godfather\nreferences. The only thing they could have done without was all the\nheavy handed social satire in reference to marginalized races or\ncultures (in this case, the predators) being grouped together based on\njust a few instances. This movie does contain and even hinge on some\nmature themes for a kids movie. For instance, officer Hopps gets Nick\nWilde to help her because of \"fellony tax evasion.\" I'm sure every 8\nyear old who went to see this with there parents understood fully why\nNick went along with Hopps. Anyway the characterization was excellent\nand as far as animated kids films go, i think it was one of the best\nDisney has created in a while. Certainly a must see for all ages. Just\nif you are with your younger kids, expect to have to explain some\nthings.\n"},
{"review": "\nZootopia promises to entertain you right from the beginning till the\nend. This is probably one of those rare times when Disney has taken a\nshot on suspense and it has done brilliantly well on it. <br><br>Story (10/10): Full marks to the story which is probably the most\nprofound story I have seen after Inside Out. Zootopia talks about the\nstruggles of the only bunny cop - Judy Hopps - town has, and the\nchallenges she faces while performing her duties due to various\nstereotypes. It is very hard to stay put against the disgust and\nbullying of everyone, which is beautifully depicted through Judy Hopps\ncharacterization. The writer has created a complete contrast character,\nNick Wilde, a fox, who gives up against those same stereotypes. He,\nironically, helps her in solving the case involving mysterious turn of\nevents in the city. The story has very interesting twists and turns\nalmost every now and then which keeps you wondering what will happen\nnext. The other characters like Chief Bogo, Bellweather, Bonnie and Stu\nHopps are very well conceptualized where they all are bound by their\npreconceived notions, ambitions and greed that pretty much is a\nmicrocosm of what Zootopia town has been. <br><br>Animation (8/10): The level of animation has been good. The creativity\nthat went behind projecting the city and its various facets is\noutstanding. Although Hollywood has moved slightly ahead but Zootopia\nstay puts. <br><br>Direction (9/10): The trio of Byron Howard, Rich Moore and Jared Bush\nhave done a great job in keeping the story moving and bringing in\ntwists and turns all the time which keeps the audience glued to their\nseats. Bringing in Shakira for the song, \"Try Everything\" and the\nnovelty in the end credits is simply brilliant. <br><br>Overall (9/10): Overall, it is a very refreshing movie which brings in\nsomething brand new from Disney. A must watch for everyone.\n"},
{"review": "\nThis was a great film. My son loved it and I'd watch it again.\nObviously it's no where as good as the classic Disney films but I loved\nhow they talked about prejudice and had so many lessons that kids can\nlearn. I would probably watch a sequel if it were to come out but sadly\nI don't think it's going to be a huge movie that can withstand time.\nThe parents of the main character were annoying but I think that was to\nshow how some parents are viewed by their kids(haha). Overall I think\nthat the intent behind the movie was great especially for young girls.\nIt showed that you can be anything if you try hard enough. It shows\nthat even the people that seem great on the outside aren't always good\nand that they might not have your interests at heart. Great lessons for\nyoung kids and a wonderful little world that Disney built for this\nmovie.\n"},
{"review": "\nI don't remember the last time an animated film's themes were so\npolitical and so prominent in everything the film was trying to do.\nHuge props to this, a family animated film focusing so heavily on race,\nprejudice, and equality? Incredibly fresh, exciting, and a very, very\nsignificant theme to introduce to children. For that reason alone it\nshould be praised. The themes aren't subtle, but they can't be, not for\nthe target audience here. Of course, the film is also incredibly\nwell-written. it follows a specific formula, but boy does it do it\nwell. Funny and witty, emotionally-heartfelt, incredibly entertaining.\nI'm not surprised it turned out to be such the crowd-pleaser with both\naudiences and critics. The voice work is also fantastic (I just love\nBateman voicing animated characters). Jenny Slate was also a hoot. This\nwill definitely be in the running for the Oscar for Animated Feature.\n"},
{"review": "\nThe animals have evolved and live together. Judy Hopps (Ginnifer\nGoodwin) wants to be a policeman rather than a carrot farmer like every\nother rabbit. She becomes the first rabbit police officer in the\nmetropolitan city of Zootopia. Chief Bogo dismisses the rookie and\nmakes her a meter maid. She encounters hustler fox Nick Wilde (Jason\nBateman). A few predator animals have gone missing and Judy jumps on\nthe case of a missing otter. With no support from the police force, she\ncoerces Nick to help.<br><br>This world is wonderful. I love the various climates in the city and\nthe different sizes of animals coexisting. The central message of\ntrying is nice. The sloths at the DMV are hilarious. When the predators\nget shunned, the movie takes it to another level. The fear and message\nof tolerance is compelling and very timely. The characters are fun and\nthe story is engaging. There is very little to complain about. The best\nI can do is that the song isn't quite as catchy as \"Let It Go\". The\nfinal reveal is obvious for the experienced. These are really minor and\nthe movie is great.\n"},
{"review": "\nWatched Zootopia featuring the Voice Talents of Ginnifer Goodwin(Once\nUpon A Time) as Judy Hopps, Jason Bateman(Juno) as Nick Wilde, Idris\nElba(The Jungle Book) as Chief Bogo , Jenny Slate(This Means War) as\nDawn Bellwether , Nate Torrence(Hello Ladies) as Officer Benjamin\nClawhauser,Bonnie Hopps(Cars) as Bonnie Hunt,Don Lake(Dumb and Dumber\nTo) as Stu Hopps, Shakira as Gazelle,Alan Tudyk(Big Hero 6) as Weasel\nfeaturing Raymond S.Persi(Wreck It-Ralph) as Flash, Maurice\nLaMarche(Futurama) as Mr.Big and J.K. Simmons(Whiplash). The film was\nenjoyable the Dynamic between Hopps and Wilde also Them have big dreams\nwas fantastic the film was a mystery thriller with fun moments also\nenjoy some it's pop culture references as well as its humor it was\nfantastic. it Musical Score by Michael Giacchino(Jurassic World ) also\nAmazing Direction by Byron Howard(Tangled) &amp; Rich Moore(Duck Dodgers)\nBest Animated Film Of 2016 10/10\n"},
{"review": "\nAt this point I've only seen 7 or 8 films from 2016, so it's no\nsurprise here that Zootopia moves into the #2 spot behind Deadpool.<br><br>It should stay in the top 10 till next spring when I round-out the list\nby finishing about 100 films. It's solid.<br><br>Kids should stay entertained with the animation and the animals, but\nmost of the humor is really adult humor. For that reason, it may be\njust about the best Disney/pixar animated film for adults in terms of\nthe humor. THere are no lulls in that aspect. You will laugh early and\noften. Credit the writers.<br><br>The plot is a bit thin, but very few animated films have\ncomplex/truly-original plots.<br><br>Worth owning. This redbox sat on the shelf for way too long, but after\nfinding the time, I don't feel bad about dropping 13-15 bucks on it.\nStill, should have just bought it.<br><br>recommended. 81/100 Personally, I enjoyed-it more than Frozen, or some\nother higher profile animated films over the last few years, but that's\nperhaps due to the lack of music and the increase of adult humor.\n"},
{"review": "\nI got a $50.00 PlayStation gift card from my daughter for fathers day\nand I couldn't find any games I wanted and my grandchildren were\nrunning around screaming as usual so I bought Zootopia. Great film for\nboth kids and adults alike. Funny, serious,a twist at the end even I\ndidn't see coming. The grandchildren were so quiet and peaceful...this\nonly happens when they sleep. Anyway, I highly recommend this film for\nANYone with children, grandchildren and even if you're an adult who's a\nkid at heart, watch it. Rent it. It's a movie that just makes you smile\nand bond with your kids. A lot of people must have shared my opinion\nbecause it more than doubled what it cost to make. You decide for\nyourselves...but I'm right. WATCH IT.\n"},
{"review": "\nI have to admit that i never really waited this movie. I only gave it a\nchance because I saw the love what this film get from the internet.\nThen i watched it and wow... I can't really tell why it is so good\nmaybe the story witch is more complicate that you wait from a furry\nmovie, maybe the main characters who's are really good together maybe\nsomething else. I only can tell that i love every part from this movie\n(yes including the Shakira singing and everybody dancing part what is\nnecessary in a Disney movie...) and this become one of my favorite\nanimation. The only thing is that in my opinion you shouldn't watch\nthis with a 6-7 year old folk because he may be scared and maybe don't\nreally understand the plot. I think the perfect age is somewhere\nbetween 14-15 years old because they can understand the main problems\nwhat the movie brings up and they can fully enjoy it.\n"},
{"review": "\n\"Zootopia\" is one of the best animated movie of the year 2016.Its story\nis nice,screenplay is good and have some funny moments too.<br><br>Animation is simply amazing.Full marks for animation. I am surely going\nto watch it again.Humor content is high in this movie.<br><br>Movie also gives some good messages like we can't judge a person just\nby looking at it and we should give everyone at least one chance to\nprove himself/herself.<br><br>Movie is very funny and likable.Movie is entertaining throughout and\nthere is not any boring moment that I remember.There are funny\ncharacters,adorable characters and some evil characters.<br><br>This amazing movie is highly recommended for movie lovers of all age.\nIts a family movie,so enjoy it with your family and friends.<br><br>Overall I give it 9/10.\n"},
{"review": "\nUsing animals as an allegory for social injustice is nothing new, as\nthe concept had previously been employed by Animal Farm and Maus (among\nothers), but Zootopia is a balancing act. It's comedic, dramatic,\ncolorful, well-written, and fun for the whole family.<br><br>The first thing worth noting is the animation. I have never seen\nanimated fur this look this real. The detail on the length and texture\nof each hair is remarkable and makes the characters look absolutely\nadorable. The environments were designed to accommodate all the\ndifferent animal sizes in creative ways, and Zootopia itself is divided\ninto several different climates (like arctic and rainforest) so there's\na good variety of backgrounds for the characters to interact with.<br><br>And speaking of characters, the way the film's two lead characters play\noff each other creates a lot of humorous moments, and a lot of the\nsupporting characters have unique personalities and intentions that are\nnot always clear. The \"predator\" and \"prey\" animals play a big part in\nestablishing the prejudice that some characters have toward one\nanother. It's kind of like Crash, but with animals, and far more\nenjoyable.<br><br>As with most Disney films, there are some very emotional scenes that\ninvolve family, trust, and friendship. All of them are brought to life\nby excellent voice acting from an all-star cast, some of which sound\nlike they were practically born to play their parts. This might be one\nof the best films I have ever seen, combining action and drama with\nbeautiful animation and well-written humor. There isn't much to\ncomplain about, because I can't think of anything to complain about. It\nreally is that perfect.\n"},
{"review": "\nWhen I first started seeing the trailers for this movie I knew it was\ngoing to be good. However, nothing could have possibly prepared me for\nhow much more there was to this movie than I first believed, and I'm\nbeing one-hundred percent honest when I say the results blew my mind!\nWhat I believed was going to be an animated comedy about\nanthropomorphic animals turned out to be a heartfelt journey of\nfriendship development and the understanding of differences that brings\nus closer rather than divides us. I'm also really impressed with how\nmuch research actually went into this project. Honestly I don't know\nany other film company that would do this much research for a one hour\nand forty-eight minute film. It's absolutely brilliant. On top of all\nthat the animation was astounding. Never before did I believe any movie\nwas worth a full score, however, Zootopia earned it. Congratulations\nDisney. You've won my heart again!\n"},
{"review": "\nThis movie has not only just funny and exciting but also social\nmessages. Although Disney has expressed stereotypes (ex: foxes are\nwily, lions are kings) a lot of times in most Disney movies, this movie\nshed light on such prejudice or discrimination. Prejudice in this\nmovies can be compared to racial discrimination in real world. Bunny\ncop and a buddy fox overcome such a prejudice and discrimination as\nwell as incidents. I wonder who becomes hopps (the bunny cop) in real\nworld.<br><br>If this movie was not an animation, it brought us gloomy and depressed\nimpression in the end.<br><br>All the Disney movies, especially recent ones make us consider social\nproblems. I love Disney the better after I watched this movie.\n"},
{"review": "\nZootopia I can already tell is destined to become a classic. Of course\nthe idea of portraying racism without actually using race is nothing\nnew. But this is one of the first films to do it, aimed at children. In\na world populated by anthropomorphic animals, Judy Hopps (Ginnifer\nGoodwin) a young bunny from rural Bunnyburrow, fulfills her dream of\nbeing a police officer in the big city of Zootopia. Unfortunately the\ncommissioner Chief Bogo (Idris Elba), doubts her abilities and assigns\nher to traffic duty. While there, she meets a conman fox named Nick\nWilde (Jason Bateman). When Bogo reluctantly let's Judy handle a\nmissing mammal case to look for Emmett Otterton, she and Nick become\nunwitting partners and friends. Along the way our two heroes are\nsubjected to animal inequality and stereotypes, which near the end\nbecomes a big part of the story. I won't go into all the details bit\noverall I thought it was a great film, with great characters, and a\ncreative world. If you haven't seen it yet, you should.\n"},
{"review": "\nZootopia is a great family-friendly, animated film. It has really good\nadult humor and is fun to watch from start to finish. The animation is\nreally good, too. The idea of a movie where animals live and act like\nhumans in an earth-like world is a great idea. Sometimes really good\nideas for movies are just good ideas and don't really do that well on\nthe big screen. Inside Out, for example, is a great idea for an\nanimated movie, but, in my opinion, it didn't actually deliver. This is\nnot the case for Zootopia. You will find yourself laughing out loud\nmany times throughout. It's a very fun movie, and you should definitely\ncheck it out.\n"},
{"review": "\nA staple of children's movies is to give animals human characteristics,\nwhether it is our feathered friends in the \"Rio\" series or our furry\nfriends in the \"Alvin And The Chipmunks\" franchise. What is different\nabout \"Zootropolis\" - called \"Zootopia\" in the USA - is that this is\nnot one breed of talking animals existing in a human world, but every\nbreed of animal inhabiting a world in which there are no humans. The\ncolourful representation of this world, the engaging variety of\ncharacters, and the clever script with a message of tolerance and\ninclusion make for a wonderful movie from Walt Disney Productions.<br><br>The basic story is a kind of \"Lethal Weapon\" pairing of two unlikely\npartners in crime- fighting: a female rabbit called Judy Hopps (voiced\nby Ginnifer Goodwin) and a shady fox called Nick Wilde (Jason Bateman).\nIn pursuit of a missing person (sorry, animal), they encounter all\nsorts of adventures and a cast of characters ranging from sloths who\nwill not be hurried to a Mr Big who turns out to be a tiny version of\n\"The Godfather\" concluding with a singing gazelle (Shakira). I took my\nfive year old granddaughter to see the movie and she loved it,\nfinishing up dancing in the aisles.\n"},
{"review": "\nAnimal Farm is an allegorical and dystopian novella by George Orwell,\nfirst published in England on 17 August 1945. After 70 years we get a\nnice movie well written and allegorical commenting on the two legged\nanimals we see every day.<br><br>Though the movie gives a solution to the animal behavior, we are yet to\nsee any solution to the daily killings of human beings - mammals too -\nby human beings in the name of religion race and what not.<br><br>Its difficult to find the solution for the whole earth as different\ntype of specimens live in different parts of the world and its very\ndifficult to have a single control over these animals\n"},
{"review": "\nZootropolis is a well-crafted Disney tale, with a simple moral message\nabout not stereotyping other people. It's a really good movie.<br><br>The main character Judy Hopps, a police bunny, and her side-kick, a fox\ncalled Nick Wilde, live in a world where animals (well, mammals anyway)\nhave evolved and become civilised. These two main characters are\nprobably not Disney's most memorable creations, but they do a decent\njob at the heart of the movie.<br><br>What's really good about Zootropolis is the huge supporting cast -\nthere are some fantastic characters among them. The two that stuck out\nfor me were Flash, the sloth, who is helpful but painfully slow, and\nMr. Big, a shrew who turns out to be a mafia godfather. There are many\nmany others.<br><br>Disney also do a great job with the landscapes and cityscapes that make\nup Zootropolis. There's loads of detail and it all looks fabulous. It\nall makes for a full and diverse imaginary world that is easy to get\nlost in for an hour and forty minutes with the family. A real treat.\n"},
{"review": "\nSlick, funny and at times rather clever, Zootopia is the kind of\nanimated movie even the most miserable curmudgeon would have a hard\ntime hating: it looks bright and pleasant, features likable characters\nand manages to sneak a few complex messages about prejudice and civil\nsocieties into a neat piece of family entertainment.<br><br>A rookie cop bunny (voice by Ginnifer Goodwin) and a con artist fox\n(voice by Jason Bateman) pair up to crack a case of mysterious\ndisappearances and predators gone wild in the animal-inhabited city of\nZootopia. Film noir and buddy movie tropes get an affectionate parodic\ntwist: the water buffalo chief wants results, an arctic shrew is a\ncrime boss, the DMV is managed by sloths, and so on.<br><br>Special praise because, in a cinematic age of excess and useless\npadding, the film is well-paced and runs at a brisk (for today's\nstandard) 105 minutes - it leaves you wanting more, instead of hoping\nit will finally end.<br><br>Unsurprising, and for once deserved, box office triumph.<br><br>8/10\n"},
{"review": "\nDisney really knows there way around a good story, one that have\nmeaning and takes up a \"difficult\" subject so that both kids and adults\nget something out of it. We were all entertained, the entire family had\nbeen looking forward to this and we wasn't disappointed at all.<br><br>You can see this just for the animation, that is really awesome and\nbeautiful, it is also very rich both in color, but also in realism and\ndiversity, the world of Zootropolis and it's different areas are really\none great spectacle to watch.<br><br>You can also see it for the characters, really just a lot of different\nrepresentatives from vast areas of the animal kingdom, the main ones\nwould maybe not be the obvious choice (a rabbit and a fox), but they\nmeet so many others and it is a great experience to watch the\ndiversity. There are so many characters to love in this, from our main\ncharacters Judy Hops and Nick Wilde, to Flash the funniest sloth I have\never seen, but there are so many other lovable characters.<br><br>You could also see it for the story and the subject, it really is a\ngreat one, it has it all and my kids got as much out of it as I did, it\nreally speaks to your senses and emotions, maybe a bit subliminal, but\nif you think about it again and again something got to give.<br><br>Maybe see it for all of the above, it is an enjoyable animation all the\nway and with all it entails, just watch it and be entertained, you\nshould be on several levels.<br><br>Location, seating &amp; time: Bio City, Nordisk Film, Taastrup, Denmark -\nBio 1, row 9 seat 1, 2, 3, 4 &amp; 5 - 17.02.2016 at 10.00\n"},
{"review": "\n'ZOOTOPIA': Four and a Half Stars (Out of Five)<br><br>The 55th feature film from Walt Disney Animation Studios. This one\nrevolves around a world of anthropomorphic animals; where a cop bunny\nteams with a con artist fox, to solve a missing animal case. It was\ndirected by Byron Howard and Rich Moore, and co-directed by Jared Bush\n(the trio also co-wrote the movie, with 5 other writers). The film\nstars the voice talents of Ginnifer Goodwin, Jason Bateman, Idris Elba,\nJ.K. Simmons, Jenny Slate, Nate Torrence, Octavia Spencer and Tommy\nChong. It's received nearly unanimous rave reviews from critics, and I\nhave to agree; it's one of the best films of the year (so far)!<br><br>Judy Hopps (Goodwin) had always dreamed of becoming the first rabbit\npolice officer (since childhood). When her dreams finally come true,\nshe's assigned to work at the Zootopia police department. Zootopia is a\nlarge metropolis; of all kinds of different mammals. Judy is (of\ncourse) initially met with a lot of skepticism (and prejudice). She\ntries to prove herself, by solving a missing otter case. She teams up\nwith a clever con artist fox, named Nick Wilde (Bateman), in order to\ndo so. <br><br>The film is beautifully animated, and full of colorful (likable)\ncharacters. It's both funny and surprisingly touching; but what's most\nbeautiful about the movie, is it's insightful message about bigotry.\nYou can never judge anyone by their appearance, or social background,\nand what better way to illustrate that message to kids; than with a\nworld full of various types of animals. I love this movie, because of\nthat message (it's one that means a lot to me), and I don't usually\nlove Disney animated films. This one is pretty important.<br><br>Watch our movie review show 'MOVIE TALK' at:\nhttps://youtu.be/8JsPKeI7y6U\n"},
{"review": "\nIt's Crazy .... But an excellent story. A message is awesome to keep up\nand right things to deliver peoples..<br><br>It shows about the feelings and emotions of each begins according to\ntheir point of view what they determine about.. what to do..<br><br>A sweet sentence says the story \"If you want something, you have to\nwork to make it happen\"<br><br>Zootopia provides a great lesson for all enough to understand it..<br><br>Zootopia is best of all for the awesome cinematography, impressive\nstory,enchanting music and stunning acting....<br><br>It's one of the awesome Film by Disney\n"},
{"review": "\nI really wasn't in any mood for a Disney cartoon. Somehow I can always\nsee behind the sheen of the screen and notice all the usual Disney\nmechanics at work. Then it happened - the word of mouth is great and I\nkept getting shoutouts from friends why I haven't checked it out. So we\ndid last night and this is the second good film I have seen this year.\nNotice I didn't use the words \"good cartoon\"?<br><br>The world of Zootopia is so meticulously designed with its own logic\nthat mirrors our societies. I came out feeling that it is a world that\nis built on metaphors and it is a real place. The emotional beats are\nspot on and pitch perfect. Thematically, this is strong. Its themes of\nempowerment and the dangers of stereotyping so timely and so\neffortlessly delivered. Unlike all the other typical Disney cartoons,\nthis latest outing is never preachy and laden with so many rapid\nspitfire puns. We laughed ourselves silly at so many inventive scenes\nand the unlikely friendship moved us. <br><br>This one has more layers than a rainbow cake. The kids will probably\nget it at one level but you know what? Over a MacDonald's happy meal\nyou can start opening their minds to read into the other themes. It is\ntime to educate them.\n"},
{"review": "\nZootopia amazed me with its script. The film focuses on the life events\nof judy who is an underrated police officer. The story line is told in\na way which keeps the audience gripped to their seats. I was especially\npleased with the voice-over provided for the characters. The film also\nhas good animation which need not be said for a Walt Disney movie. The\nwhole concept of the movie is interesting as it tells the story of\ncivilized animals. <br><br>Walt Disney ceases to amaze us with its animation and script as this is\nworthy of mention. The villain didn't exactly take me by surprise\nthough. But it is no flaw. Overall i would have no trouble watching a\nsecond part for this movie which explains my interest for it. 😉\n"},
{"review": "\nZootopia really is pretty darn good. The actors that voice the\ndifferent characters really were picked well. Jason Bateman, Ginnifer\nGoodwin, and shakira were great leading voices amongst others. The plot\nis very interesting and also teaches a very good moral lesson. The\nwriting is very clever, funny and irresistibly entertaining. The action\nsequences were well done and fun to watch. The animation here is very\nstate of the art and well done. The events that lead up to the very\ninteresting ending are all very fun, smart, and entertaining. This\nmovie keeps your undivided attention, that's for sure. The lesson this\nfilm teaches and depicts is a very good message, especially for the\nyounger crowd. Children, teenagers, and adults will all love this fun\nride. Disney has done it once again. Go out and have a little fun with\nZootopia! 8/10.\n"},
{"review": "\nBasic story summary badly written by me: A rabbit named Judy Hopps has\ndreamed her whole life of becoming a police officer in the city of\nZootopia. Part of her dream of working in Zootopia is for her to live\nin a place where she isn't judged based on what animal she is, which is\nwhat she had experienced in her childhood on the countryside. After\nbeing excluded from a case involving missing animals at her job and\nassigned to parking duty instead she soon realizes that things were not\nquite as she imagined in the city. In her own investigation into the\ncase of the missing animals, Judy herself starts to question if there\nis some legitimacy or not to whether different animals are inherently\ndifferent from each other.<br><br>Disney movies are good movies. It is as simple as that. Zootopis does\nhowever NOT do anything groundbreaking, and not even anything\nparticularly new. Using animals as a way to portray differences between\ncharacters is nothing new, using animals as characters is nothing new,\nthe humour is GOOD but nothing extraordinary, the story itself is\nnothing special, and the moral of the story is, again- nothing new.<br><br>The movie doesn't do anything bad, the movie is overall good and fine.\nThe characters are good and many of them pretty funny. The story is\ngood even if it is nothing new, and it is mostly catered to children.<br><br>If anything, i would say that the whole moral message about peoples\nequal value (or whatever) often feels a bit too forced, and that the\nfilmmakers at times tried too hard with it.<br><br>I don't really understand how this has gotten almost perfect scores\nfrom critics. There is nothing groundbreaking here, but it is a solid\nmovie. It didn't really make a big impact on me, the only thing i would\nsay is that the animation is really quite impressive.<br><br>I imagine that kids would really like this movie, there are animals and\nfriendship and stuff.\n"},
{"review": "\nI think kids will not see the whole beauty of this movie. It is\ndefinitely for adults.<br><br>And it is amazing. It made me laugh so hard at times that I almost\nforgot that I am watching animation. Seriously, where are the good\nstory-tellers and directors when you need them for a normal movie?\nApparently they are all in the animation business. Well, good for us -\nthose who prefer Disney and the other players on that field. Well done! <br><br>Will recommend this to all my friends and coworkers - even some of them\ndon't like animations. It is worth to watch and contains more\ncreativity and soul than almost everything big screen movie that I have\nwatched those days. And yes, I am talking about Star Wars and X-Men :)\n"},
{"review": "\nThe movie is well animated and there were a few lines that made me\nlaugh but overall the movie fails to deliver on it's liberal and\nmulticulturalist message. The problem is that is uses the worst\nmetaphor possible by putting all these different species of animals\ntogether. There is a reason they segregate the animals at real zoos, if\nyou mixed them together you would have zoopocalyspe not zootopia. So\nthe metaphor fails in that it is promoting values that are unnatural.<br><br>The fox character lives up to his stereotype but then the movie comes\nup with a very contrived reason for this that isn't very believable.\nThe explanation in why the predators \"revert back to their nature\" is\neven more absurd rather than just to accept the truth, that they are\npredators and it's in their nature to behave that way.<br><br>The funniest part of the movie is the sloths in the DMV. Here the movie\ngoes off it's message and comes up with a great metaphor for anybody\nwho has had to deal with idiots promoted into jobs via affirmative\naction.<br><br>The movie would have been hilarious if they would have changed a few\nthings and made it a parody.\n"},
{"review": "\nSluggish plot that is kind of predictable, a violent detective story\nthat was not exactly for kids, but most of all it was chock-full of\nmulticultural leftist propaganda that will leave you thinking you just\nwatched a govt infomercial. <br><br>The entire movie was a thinly-veiled message on tolerating the more\n'aggressive' members of our society (who were all more 'ethnic'\nanimals) and learning to trust/adopt rather than deport them. <br><br>I think Frozen marked the beginning of the shift toward the left that\nDisney will be doing for the next films. I don't think I'm going to see\nany more of them. Children's movies should not be tools for political\nmessaging.\n"},
{"review": "\nSaw it yesterday with a friend of mine....I'm 58, she's 64.....we loved\nit! However, I can see that much of the dialogue of this movie would go\nstraight over the heads of younger children. A friend of mine took her\n5 yr. old grandson to see it and he was bored so they left early. As an\nadult, I found it very entertaining to see references to The Godfather\nand Breaking Bad, but most children wouldn't grasp it! The dialogue\nreminded me of how the Bugs Bunny cartoons used to be....loved it as a\nkid but realized all the satire later as an adult!<br><br>This movie was very beautiful visually. Loved all the bright colors. I\nalso enjoyed trying to figure out who the character voices were as I\nhadn't checked prior to seeing it!\n"},
{"review": "\nThe film features anthropomorphic animals who wear garments but for\nsome reason no shoes. It centers on a gray rabbit named Judy who\npursues her childhood dream in becoming a cop. She fails in her first\nattempt in police academy. She would, however, return, pass every test\nand finally become a cop. After dealing with parking violators, Judy is\nassigned to find a missing critter.<br><br>Zootopia is as entertaining and funny as any animated film featuring\ntalking animals. Perhaps better, considering the film earned over $1\nbillion at the box office. Is it flawless? Almost. It would have been\nabsolutely flawless if the young Nick in the flashback wasn't played by\na bimbo. That bimbo happens to be the same stupid bimbo who played the\nstinky purple polecat in Tiny Toons. Is getting a real boy too darn\nhard?\n"},
{"review": "\nThis movie is a waste of resources in all sense. Is again the typical\nweak that saves the day but animals instead of humans. <br><br>In points: <br><br>-The storyline sucks, boring, slow, I can't keep my eyes or my child's\neyes open. The entire movie is a \"police\" investigation in 80's style,\nwith few and boring jokes <br><br>-The only funny scene is in the public administration, I have to admit,\nbut the only? This kind of movie give a lot of resources to play,\nanimals that are funny by themselves. <br><br>-Moral..., again? This bores to everyone, if you want moral, you must\nread Nietzsche, or talk to your kids, don't go to the cinema, because\nis no made for that. <br><br>Sorry for the English, no native.\n"},
{"review": "\nOkay. Let me be honest here. I knew I would enjoy this film since I saw\nthe trailer, but I did not think I would like it THIS much! Now, like\nmost of my reviews, I am going to keep it brief. I do not want to spoil\nthis movie because, unless you have already seen it, I would say its\nworth seeing. This movie really changed my perspective on Disney. The\nfilm had my attention the entire time, I was never bored at any part.\nIn fact, I was so caught into this movie, that when I went to set down\nmy drink, I missed the cup-holder and dropped it! It did not spill but\nanyway, not to get off topic, it was an overall great film. This is one\nof the few movies that will receive a 10/10 rating. I was impressed,\nwould recommend to anyone, not just kids. So, in conclusion, one of the\nbest Disney movies I have ever seen, would watch again.\n"},
{"review": "\nThe result did not match the marketing. Story is so so but visuals like\nusual so great and pretty. Yep, children love what they see and what\nstory? Basic zoology that fox eats rabbit, predator and prey, habitat,\nanimal behavior etc. Then this prey and predator become friends and\nescaped the horror of deviantart. Rabbit jumps, fox is sly, lion mayor,\nwolf in sheep's clothing, otter is a predator (the predators are bulky\nand this is a cutie???), sloth is slow. This year children will learn\nso much about animals adding zyuohger and kung fu panda and what else?\nI was wrong to hope for a good story from a cartoon but oh well who\ncares when you got beautiful art.\n"},
{"review": "\nThis movie scared the living daylights out of my 3 and 4 year old. The\ncontent was not really funny (It had a couple of spots but they were\nfew and far between). The worst part of the movie was a Silence of the\nLambs Insanity Ward where the beasts were kept. (Remember Jody Foster\ngetting semen thrown at her) My children cried and we left the theater\nwhen the (spoiler alert, near the end) . The movie should be rated PG13\nas the themes were more suited to teenagers who could handle aggressive\nanimals, mob mentality of killing someone, New York style hardcore\nsarcasm where no one cares about anyone, and Meth lab where an insane\nlooking sheep in an DU HAST video with air breather is making \"night\nhowler\" I am a guy that has seen his fair share of freaky, and I love a\ngood movie (going for Apocalypse Now tonight) BUT this show is not for\nkids, and I am aghast that Disney put it out. I remember enjoying the\ntime of Toy Story, Nemo, Hero 6, Wall-e, Up and great Disney Movies\n(Shrek, Shark Tale, Madagascar from the \"other guys\") This movie was to\ndeep in subject matter and the message was for teenagers and not little\nchildren.\n"},
{"review": "\nZootopia is a perfectly hilarious and remarkable movie not only for\nchildren,but also for adults.<br><br>A rabbit Judy Hopps (Ginnifer Goodwin) peacefully fights for the rights\nof weak animals.(A good theme from the great Disney).<br><br>There are several animals with various characters and different traits\nexactly as there are numerous individuals with different characters.<br><br>The script is didactic,great and funny.<br><br>Just like us Virtuous Christians And Good Mormons,we never discriminate\nagainst Jews,Muslims, Blacks.... et cetera so is this movie's terrific\ntheme:\"Don't have prejudice and discrimination about others. Learn to\ntreat others well, respect and estimate others exactly the way you\nwould love to be treated\".\n"},
{"review": "\nJudy Hopps is a young rabbit with dreams of one day becoming a police\nofficer. No rabbit has ever been a police officer, but Judy perseveres\nand succeeds. Now she is off to Zootopia, a multi-animal society where\nall animals, predator and prey, live in harmony. Her euphoria and\nidealism is short-lived, however, as she discovers that prejudice\nbetween species still exists, and she even starts to doubt her\nanti-stereotyping stance. What's more, she's assigned to parking meter\nduty...<br><br>Wonderfully original. The idea of animals harmoniously coexisting in\none world, and essentially representing characters that humans would\nusually take, on has been done (Jungle Book, Robin Hood) but not to\nthis extent. Some great little in-jokes and use of the different\ncharacteristics of the different animals.<br><br>Nice story too, with some very engaging plots and characters. Some\nclever pop-cultural references too (eg The Godfather, Breaking Bad).<br><br>Behind it all is a great anti-prejudice, anti-racism message which is\nconveyed very effectively. Maybe a little too effectively in that it is\nlaid on a bit thick and comes across as preachy. A bit more subtlety\nwas in order, though, for kids, the target demographic of the movie,\nthe level was probably about right.<br><br>Voice casting is spot on, with a host of stars contributing: Ginnifer\nGoodwin, Jason Bateman, Idris Elba, Tommy Chong (as a stoner, of\ncourse!), JK Simmons, Octavia Spencer, Alan Tudyk, Shakira, Bonnie\nHunt.\n"},
{"review": "\nI hate Disney and I hate everything Disney stands for and I hate seeing\nthat Disney name on \"Star Wars\" merchandise and I'm still upset that\nGeorge Lucas sold the \"Star Wars\" franchise to Disney. That broke my\nheart! But anyway, I'm here to review the film \"Zootopia\". As I\nexpressed earlier, I hate Disney but there are a couple of Disney\ncartoons I liked such as the \"Incredibles\" and of course \"Zootopia\".\n\"Zootopia\" is a film about all animals, herbivorous and carnivorous,\nsupposedly living together in harmony but that harmony is disrupted by\na strange conspiracy and a bunny cop and a con artist fox help each\nother out to find out what that conspiracy is. This film is great for\nchildren and adults alike. Adults are going to enjoy this film with all\nof the references laid out in the film. The kids are going to like it\njust because it's a cartoon. On the slick I think this film was\nshedding light on how destructive racism and other forms of prejudice\ncan be and it was also teaching a lesson on treating others with\nrespect and treating others exactly how you would want to be treated.\nThe actors in this film did a great job voicing their characters. It\nwas very fun trying to figure out what celebrity was voicing what\ncharacter. This is a good film that's great for all ages. You will not\nbe disappointed with this Disney film, I wasn't and I hate Disney\nfilms!\n"},
{"review": "\nI see the publicity in supermarkets and I think to myself this must be\nanother Plains with the race background scraped and a cops and robbers\ntheme pasted over. This film is nothing like that. It has a well\ndeveloped story, characters that have their own personalities, although\nsome of the smaller roles are filled by stock characters. And the best\nof it: the main characters do evolve. Overall the film is fun, although\nthere are some tense moments that might scare younger children.<br><br>I discovered only after the film how long it is, but at no moment I\nfelt the need to check how long till the end, which is not easy\npredictable as most Disney productions. Sure, there is a happy end so\nthe end is not that hard to guess.\n"},
{"review": "\nLovely indeed and highly recommendable for all teenage &amp; adult Disney\nanimation fans on any rainy weekend morning... Though not really for\nkids, some scenes might give them nightmares ! I particularly loved the\nnearly perfect graphics (Nick &amp; Judy, in particular, are incredibly\nadorable); some very inspired contrasts such as Mr. Big's size in\ncomparison to his bodyguards &amp; mafia organization; Nick &amp; nephew's\nfunny schemes to make money; the very interesting organization of\nZootropolis town catering for all of its inhabitants' environment and\nclimate needs (Judy's journey from the countryside to the metropolis is\nparticularly inspirational); the local police (awfully hilarious !);\nand lots of other very well- inspired, funny and perfectly rendered\nscenes &amp; details. The prime idea promoted by this movie, i.e. that we\ncan all live together in peace, in a non-divisive, non-discriminative\nand balanced social environment within the rule of law is super... and\nhighly to-date given some more recent events in our real world... Not\ngiving it a full 10 because I would have loved my 4-YO grand daughter\nto be able to see it too, from beginning to end... I guess she'll have\nto wait some 4-6 years more until this may happen... Nonetheless, the\nrest of my family sends a huge Thank You and wishes for more from the\nmakers of Zootropolis !!! (P.S. Kisses to Nick &amp; Judy !!!).\n"},
{"review": "\nI had no idea what I was about to see. My step father told me to go and\nI trusted him cause we basically like the same kind of movies.\nEspecially animation movies. When the movie began, I thought I was\ngoing to see a cartoon for children but after five minutes, it all\nchanged. This is a really cute and funny (sometimes hilarious) movie\nfor adults and kids. Nice and original characters, great story. I laugh\nto tears during some scenes and spent a very good time. One of the best\nanimation movies I've seen the last few years. You won't get bored at\nall. I would definitely watch it another time. Bring your\ngirlfriend/boyfriend, friends and kids. Go and see it, you won't\nregret!\n"},
{"review": "\nZootopia is among if not the most notable animated film to be released\nthis year. For actually analyzing it critically, it continues Disney's\ntrend of selling us non-sleazy animation that gives us messages and\nthings to give thought in addition to simple comedy. The comedy is\nrather blowout and, despite seeming like it contradicts its message,\nends up giving us more perspectives on the matter. The plot, in\naddition to the comedy, is not only organized, but provides\nnon-preached messages that would be unheard of in most family animation\ntoday for its maturity. Among these are anti- discrimination and\nanti-prejudice, with hints of anti-corruption by our \"protagonist\",\nJudy Hopps. Besides Hopps, the characters are ones that can be\ncherished by all audiences, from little children to their grandparents.\nThey either provide wonderful comedy or have us think about what is\noccurring in our world. I am writing this just as the United States is\ngetting over the election of Donald Trump, whose campaign has been\nmarred by the very same things this movie speaks out against. I am\nstill hopeful that we can preserve our more-than-great nation with\nmessages like the ones in Zootopia. Otherwise, this film might be\nforgotten by many US citizens the same way it immediately generated\nhigh praise among critics. It doesn't deserve to be, though, so no\nmatter who you are, consider this a film you will want to watch. Like\nMary Poppins, I cannot recommend this film enough.\n"},
{"review": "\nA rabbit, Judy Hopps, travels away from home to fulfill her dream of\nbecoming a police officer after facing much adversity and prejudices as\na child. When she gets to the big city she finds that she still has\nmuch to overcome, but is resilient and refuses to give up. This movie\nis great for the whole family with a great story line with a rather\nmature message. This movie references some of the greats such as The\nGodfather and Citizen Kane. Whether you are a kid or an adult you will\nwalk away from this film with a smile on your face and pondering social\ninjustices/prejudices that currently exist in our society. This is a\ngreat movie and I recommend everyone go see it.\n"},
{"review": "\nI was finally able to sit down and watch this film with my kid and was\nquite pleasantly surprised with it! The animation is quite good and\nsmooth! There were a lot of jokes and references that I found\nentertaining that kept my interest invested in the overall story line\nregardless of my child's responses to it as a whole.<br><br>The one downside is that the plot can be predictable at times, but\nthat's almost to be expected. Overall, the characters have good\ncontrasting personalities, the story is cohesive with some plot points,\nand the establishment of the world was cute and fun.<br><br>Zootopia is really well done, and I would recommend it to anyone that's\nlooking for a good family film on a night in!\n"},
{"review": "\nI cant say enough how much I love this movie! Not really an animated\nwatcher, but was played in my spin studio and just cant wait to get\nhome to finish watching it. From the beginning I smile a lot because of\nall the cuteness overload and very inspiring starters. The movie keep\ngetting interesting, unpredictable, inspiring, and touching. It covers\npolitical issue, with profound messages that can be really inspiring\nand a massive solution to our social problems. I like how this movie\nreally has depth and yet, still appealing to all groups of people who\nsimply one something light and happy. I am very looking forward to see\nthe next sequel.\n"},
{"review": "\nThis is one of the most amazing films that I ever seen. I went to see\nthis for birthday and I loved this movie. You can't miss it. I would\nhighly recommend this movie. I think that this movie is for all ages\nnot just young kids. Throughout the movie, you get lots of different\nemotions. Sadness, Love, Happiness. These are some of the emotions I\nfelt during that movie. This movie was hilarious I was crying with\nlaughter at some of the points of the movie. There are lots of\ndifferent animals in this movie. But my favorite animals were the\nRabbit, Fox and the Mole. The bunny has got lots of high hopes and\ndreams in this movie and tries its best fit in. This bunny also\nimpresses people and helps solve mysteries which leads the bunny into\ntrouble with people.\n"},
{"review": "\nIf you have not seen the movie, go see it. Either in cinemas or just\nbuy it i'll wait. The movie is a very cute story about a bunny who\nmoves to the big city of Zootopia to work in the ZPD (Zootopia Police\nDepartment). When a string of disappearances/violent attacks of\npredators ensues Judy Hopps must enlist the help of a street smart fox\nNick Wilde to help her save the city (Hope you already knew that).<br><br>The movie has a lot of teachable moments about racial acceptance as\nwell as what it truly means to be a hero. It has enough of this\nsub-plot to keep even the parents entertained and the warm fuzzy stuff\nfor the kids. It is the second highest grossing original film at the\nmoment and is probably the best animated movie this decade so far.\n"},
{"review": "\nI seen a lot of great stuff from Disney alone, Frozen, Big Hero 6 etc,\nbut never have I seen a film that truly represents Prejudice and\nDiscrimination and the today's society in the best and right way\npossible, this is by far (till Moana comes out) the best Disney\nanimated film I've seen from them, fantastic concept, Beautiful and\nwell crafted animation, Love able characters (Nick, Judy and Flash are\nmy personal favorites), a great message about prejudice and\ndiscrimination and great Disney comedy that we all know and love!.<br><br>One issue I have is It don't have enough emotional scenes In It, which\nis a shame because there are a few times I did cry to this, however It\nfelt a bit too rushed and the main antagonist Isn't that well revealed\n(because of people spoiling It, thanks Internet!) and the minute the\nantagonist shows up in the reveal, It's becomes very obvious, but\nthat's only a nitpick.<br><br>This is a must watch for Disney fans, Furies, and people who are on the\nsubject of Prejudice and Discrimination, please go watch on DVD and/or\nBlu-Ray, It is really worth It!.<br><br>As expect It gets a 10/10\n"},
{"review": "\nThe animated film, Zootopia, is a heartwarming tale made to teach young\naudiences about the importance of acceptance, perseverance, and\nfriendship in our society. Created by Walt Disney Animated Studios and\nfeaturing the voices of stars such as Jason Bateman and Idris Elba, the\nfilm tells the story of an unlikely friendship between a bunny and a\nfox. The film is a much needed break if you are searching for an\nentertaining yet appropriate movie for both you and kids, then Zootopia\nwould be a perfect choice for you. At first, the plot line of Zootopia\nmay just like many other children's movies that have already been\nreleased. 'Two unlikely animals defy social stereotypes and become\nfriends anyway' is something that both you and I have probably seen a\nmillion times before. But, when watching Zootopia, the plot is somehow\ncompletely different than things that I have seen before. Firstly,\nthere are subtle references to popular culture, that most kids would\ngenerally not understand. The character Walter White, from Breaking\nBad, was probably the most obvious one, probably included in order to\nkeep adults and teenage generations interested. Secondly, the plot line\nis a bit more complex than many other children's movie, and the plot\nhas much more to it than the relationship between the two friends. Plot\ntwist, after plot twist, this movie has you thinking constantly, making\nthe ending far from predictable. Overall, Zootopia is a great,\ninspiring movie that, although aimed toward younger generations, can be\nthoroughly enjoyed by people of all ages.\n"},
{"review": "\nThis animation has a clear and strong message that does not only\nestablishes uniting spirit between different religions and ethnicities\nin youngsters, but also highlights the jingoism and xenophobia that\nfires up by the exact same politicians who fires it up in first place,\nin order to use it as a vote collecting strategy. <br><br>Special thanks to the authors. I thing that this animation should have\nbeen considered for Nobel peace prize.<br><br>Last but not least the characters are super fun with extremely cheering\nvoices.<br><br>Highly recommend it for all age groups.\n"},
{"review": "\nRate: 9 out of 10 <br><br>This movie is not really what Is expected. Based on previews and\ntrailers, I assumed it would be a lame kids movie that I would see my 6\nyear old sister watching. After the first few minutes I was intrigued.\nSome of my favorite parts were the reference to the classic 1972 film\n\"The Godfather\". I also like how this movie is packed with life\nlessons. This is usually the norm for Disney movies but this one brings\nan interesting point considering its only animals. Without giving to\nmuch away, this film basically teaches you to chase your dreams no\nmatter who tells you its unattainable. To live your life free and to be\nopen to different cultures and experiences. This movie has a great\ntheme and story line. Its easy to stay with and an overall enjoyable\nfilm for the entire family. If there was one thing in this movie that I\ncould change, it would most likely be giving the main character Judy\nHopps at least one person that believed in her. She had not a single\nperson in her corner until the movie progresses.<br><br>Some significant cinematography were close ups and aerial shots when\nJudy begins to spy on her witness. Scenes that start behind the\nshoulder just as seen in the godfather. Some Diegetic sound is\nincorporated, especially in the opening credits and the scene where the\nanimal citizens get of the train in Zootopia.\n"},
{"review": "\nIn a large city of animals, one would expect many problems to arise,\nseeing as they have stark differences about them. The huge metropolis\nbeing divided into sections, the tundra, rain-forest, desert etc.\nallows animals to live where they need in order to survive, however\nthere are two themes presented throughout the entirety of the movie.\nThe first being a predator-prey relationship they strive to put behind\nthem, Zootopia also presents the issue that if you were born a certain\nanimal, you were expected to behave in a certain way/pursue a certain\npath in life. This is presented head on when Bunny Judy Hopps is\nintroduced. Although she is expected to be a carrot farmer, she\ndedicates her life to being a police officer. She is then presented\nwith the challenging question that seems to be taking everyone by\nstorm. Does being a predator truly make an animal a more\nviolent/untrustworthy citizen? With a sly predator by her side, will\nshe be able to debunk this question? The film Zootopia has a positive\nmessage as it pushes the idea that no matter who you are, you can\nachieve whatever you want as long as you have the passion for it.\n"},
{"review": "\nIt's a really nice movie, kids like it, and if you're a little older.\nyou could see some life lessons in this movie. Parents should watch\nthis movie with their kids I really loved the concept of a bunny that\nfinds her sort as good as other animals, because i've never seen that\nbefore. Even though the rest of the animals think that a bunny can't do\nanything good as a police officer, she will prove it. i just love that.\nIt's cool that a bunny and a fox can be friends after the fox had stole\nsomething and she was a police officer. Disney did a great job once\nagain. You should give it a try, i bet you will like it and see the\nlife lessons of the movie.\n"},
{"review": "\nAmazing, funny and i just love it. Very interesting and congrats to the\nteam. :) Love it. Love it. Love it. Good job! --- Amazing, funny and i\njust love it. Very interesting and congrats to the team. :) Love it.\nLove it. Love it. Good job!Amazing, funny and i just love it. Very\ninteresting and congrats to the team. :) Love it. Love it. Love it.\nGood job!Amazing, funny and i just love it. Very interesting and\ncongrats to the team. :) Love it. Love it. Love it. Good job!Amazing,\nfunny and i just love it. Very interesting and congrats to the team. :)\nLove it. Love it. Love it. Good job!Amazing, funny and i just love it.\nVery interesting and congrats to the team. :) Love it. Love it. Love\nit. Good job!\n"},
{"review": "\nI'll admit that a spunky hero pursuing her dreams in spite of the odds\nis pretty much half of the cartoons out there. And yet, this one seemed\nto do more with the story. I was engaged by Judy's seemingly ridiculous\ndetermination to overcome prejudice and biology to follow her dream.\nUsing a world of animals to call out racism and suspicion of \"the\nother\" was ingenious and well handled. And the central mystery was\ngenuinely intriguing. Often spunky heroines and clue solving feel like\nsimply a hanger off of which to hang the jokes, but it feels like more\nthan that here.<br><br>And the same time, the movie does have those jokes and clever concepts.\nThere is in particularly a fabulous use of scale involved in a world in\nwhich giant giraffes and elephants life in the same city as mice, with\ndifferent neighborhoods built for their occupants.<br><br>I found this movie funny, touching, and intelligent, and yet there is\nalso something rather slight about it. <br><br>There is something about this movie that makes me somewhat articulate.\nI can't quite explain why I was more affected by the story than that of\ndozens of other overcoming-the-odds movies, and I also can't quite\nexplain what subtle something was missing that prevents me from giving\nit a higher score (I was torn between 8 &amp; 9). But it's a terrific\nmovie.\n"},
{"review": "\nZootopia is a revolutionary and meaningful animation blockbuster from\nDisney. the story line follows bouncy Judy Hopps (see what I did\nthere)on her journey to animal mega-city Zootopia where she teams up\nwith the sly and cunning nick Wilde, together they help each other\novercome their challenges and solve the Night Howler Case.<br><br>I found this movie inspiration due to its reflection to its real world\nviews covering racism, Drug troubles and sexism. the movie marks\nDisney's first use of applying their revolutionary new hair engine\nwhich allows the movies characters to be seen in a more unique and\ndetailed way then ever before. the plot could have been extended but\nconsidering this the story line was still gripping and I am sure has\ninspired many furries and has turned many people into furries\nthemselves (including me) I highly recommend this movie to any Disney\nfan or anyone looking for a brilliant movie to sit down and fall in\nlove with.\n"},
{"review": "\nThe best animation I've seen in s long time. Brilliant plot twists and\nturn. Brilliant characters Virtually no sex, violence etc Only one\nslightly slightly scary scene but it was well suited and helped to keep\nthe attention of its audience. The overall tale is unusual and is\nbrilliant even for teen and adults. I've rated it a 9/10. Can't wait\nfor number 2 to appear! Come on Disney- try and top this one! This is\none of the best animations for the whole family to watch. My family has\ntwo males and both enjoyed , they said, and I quote \" Was quite good,\ninteresting plots!\" So honestly, I definitely recommend for anyone\nwanting a family animation to watch for a change. Wou.d say that this\nis. A comedy/Very Slight Crime/ Very Slight Action. 🤗🤗\n"},
{"review": "\nZootopia is a great surprise this year for me , I expected more\nliveliest for a good laugh and so , the more this film is more than\nthat , it has a great message , the characters are great , I enjoyed\nthe Hopps , one of the best character of the year, the rabbit , the\nvoice cast is very good, Ginnifer Goodwin , Jason Bateman , Idris Elba\n, Jenny Slate, JK Simmons , Nate Torrance, Bonnie Hunt , Tommy Chong\nand etc , the script is good , the film is full of great characters ,\nplus some are kind of boring , I do not really liked Nick Wilde fox ,\nthe film has funny moments , the scene of laziness is really fun , the\nsoundtrack is good, and the last are really cool , just like the movie\nall , Zootopia is one of the best films of the year , surely will\ncompete for the Oscar for best Animated Feature of the year. Note 8.6\n"},
{"review": "\nI am absolutely sure Zootopia Will Be Number 1 In All Countries Of The\nWorld Without Any Exaggeration.<br><br>Walt Disney Pictures clearly delivers a useful moral of\nlove,unity,integrity and peace of mind.<br><br>since Judy is brainy and has a strong will to be a successful cop,she\nmade a deal with a sly fox to get what she wants.<br><br>When the genius and the yummy bunny Judy became a policewoman,she was\nso just and confident in dealing with other animals and soon she\nreceives all the estimation from all the animals including the\npreviously prejudiced animals who underestimated it.\n"}
]