[
{"review": "\nRather than concentrating on everything that is great about The\nGodfather, a much easier way for me to judge its quality is on what is\nbad about it. Almost every film has something that I don't like about\nit, but I can honestly say that I wouldn't change anything about The\nGodfather. There is nothing weak about it and nothing that stands out\nas bad. That's why it gets ten out of ten.<br><br>This is one of those films that made me wonder why I hadn't seen it\nearlier. The acting from everyone involved is great, Marlon Brando\ncomes across perfectly as the head of the family, and James Caan and Al\nPacino are excellent as his sons. The soundtrack by Nino Rota is also\nvery memorable, bringing back memories of the film every time I hear\nit. The plot has to be excellent for it to get ten out of ten, and it\nis, it's far from predictable and the film is the definition of a great\nepic.<br><br>The film is pretty shocking in the way every death occurs almost\ninstantaneously, and as it spans ten years so many different things\nhappen and every minute of it is great entertainment. It's a well-made\nand entertaining film that is only the first part of a trilogy, but it\nstands on its own as a wonderful film in its own right. If you haven't\nseen it, what are you waiting for? This was one acclaimed film that\ndidn't disappoint.\n"},
{"review": "\n\nThis is by far the best movie ever to give a portrait organized crime,\nthis\nmovie goes deep inside and shows it all inside out..<br><br>With superb acting by especially Al Pacino as Mike Corleone and Marlon\nBrando as Don Vito corleone this movie shows how one of the head mafia\nfamilies in New York works, it gives a detailed picture of how their\nbusiness runs and what kinda chances they got to take on their business,\nfor\nexample their denial to step inside the narcotic business brings on alot\nof\ntroubles, but also it shows what kinda sacrifices they make, every day\ncould\nbe their last day..<br><br>Al Pacino shines above all in this movie, as the smart boy of the family\nhe\nreturns after fighting a war for his country, at that time not involved in\nthe family business, but it doesn't take long before the war breaks lose\nand\nhe see no other ways than to step in and fight for his\nfamily.<br><br>This is definetely a \"must see\" masterpiece.\n"},
{"review": "\n\n     This movie is strong, good script, great casting, excellent acting, and\nover the top directing.  It is hard to fine a movie done this well, it is 29\nyears old and has aged well.  Even if the viewer does not like mafia type of\nmovies, he or she will watch the entire film, the audiences is glued to what\nwill happen next as the film progresses.  Its about, family, loyalty, greed,\nrelationships, and real life.  This is a great mix, and the artistic style\nmake the film memorable.  \n"},
{"review": "\n\nThe Godfather is one of the very few films that doesn't have a single flaw. \n Seeing The Godfather for the first time was the most amazing movie\n experiences of my life.  There's scenes that stay with you when the movies\n over, and you don't forget them.   Everyone makes the mistake of calling\n this film a movie about crime.  Its really a movie about family.  The\n dialogue is just unbelievable.  I've seen the movie at least 30, 40 times,\n and I'm still amazed at how perfect it is.  The music, the acting,\n everything.  People think that Citizen Kane is the greatest movie ever\n made...well, there's no way  that ANYONE can think that Citizen Kane is\n more moving, and has a better storyline than The Godfather.  The thing I\n find so amazing about The Godfather is how Michael (Al Pacino) changes\n throughout the movie.   Its my opinion that this is the greatest movie\never made,\n and I doubt that anyone can watch this movie, and think I'm crazy.\n"},
{"review": "\nThis must rank as the best film (along with part 2)of all time.An\nensemble performance that has no weak spot.<br><br>Particularly, John Cazale ( Fredo) and Richard Castellano ( Clemenza)\ngive wonderfully understated performances. You just have to believe\nthat Castellano WAS Clemenza, he brings a real touch to his role.<br><br>John Cazale brings the troubled Fredo to life, and you can see the weak\nFredo desperately trying to live up to the family reputation but\nknowing that he can never be what his father wants. <br><br>The story of one man's reluctance to be drawn into the murky family\nbusiness,and his gradual change through circumstance, paints a vivid\npicture of this violent period of US history.<br><br>Do not miss this film!\n"},
{"review": "\nI love this movie and all of the GF movies. I see something new every\ntime I have seen it (countless, truly). The story of tragedy and\n(little) comedy that exists in this film is easily understood by people\nall over the world. This film has been called an American story however\nI have met others who have seen this movie in other languages and they\nseem to have the same love and appreciation for it that I do. I love\nthe characters and all of the different personalities that they\nrepresent not just in families but in society itself. It seems like the\nentire cast is part of every other movie that I love as well. The\nsounds, music, color and light in the film are just as much a part of\nthe film as the people. This could be attributed to the method in which\nit was filmed. At many parts of the film I can still find myself\nfeeling the emotions conveyed in the film. I never tire of appreciating\nthis film. I thank God that FFC is an American treasure. We are\nfortunate to have him.\n"},
{"review": "\nThe godfather trilogy is an exclusive set of movies that will continue\nto live with humanity, every generation will see them to say, \"Oh that\nwas 10 out of 10.\" If you watch them you will know that the world that\nlives inside the underworld is same as the one we live in except that\npeople in underworld are so smart, in fact smartness is the only thing\nthat can keep them there. Don Vito Caroleone's early life shown in\npart-II is very well done to show the Don in making, how a kid who\ncouldn't even tell his name went on becoming a underworld don who keep\nmost senators, judges and lawyers in his pocket. Meeting of don with\nthe so call five families are among most impressive scenes.<br><br>A saga that goes on for 9 continuous hours takes you around various\nwalks in life of Mike (Don's younger son who become Don later), his\nschool days, love life, personal life, family life, business life,\npolitical life and religious life. How all of these different roles\nMike plays in his life and how intertwined these are.<br><br>I enjoyed watching these movies so much, I wish I had seen them much\nbefore then I did. Its amazing to see how the Part-III was made 18\nyears later the part-I was made and everything looks so continuous if\nwatch them together.<br><br>I need not say much! The Godfather father trilogy been around for a\nwhile and everyone knows that they are great set of movies, its just\nthe matter of when you actually get to see them.<br><br>Watch them! Kudos to Francis Ford Coppola! -Vishy\n"},
{"review": "\n\nEngrossing motion picture that features some of\nthe finest editing, cinematography and performances\never. There is a wonderful theme of family that\nruns through this film and its later sequels. No \none is truly judged. Love is unconditional. God is\nthe one who truly judges. Easily, the word\nmasterpiece describes this film, but that's \nbeen said by so many...Who am I to argue? Masterpiece\nis right on the money.  \n"},
{"review": "\nThe Godfather is an extravaganza, nigh flawless, a cinematic magnum\nopus, ubiquitously acclaimed for its brilliance and for being in a\nleague of its own. The Godfather doesn't depict poetic justice but\nrather portrays the triumph of perspicacious potency over abject\nvulnerability. The Godfather is known, not for its cogency but for its\neloquence. <br><br>The movie being star-studded is decorated with a plethora of supernal\nperformances and it won't be a hyperbole that almost every actor gave\nan Oscar worthy performance. Marlon Brando is exceptionally brilliant\nin his sterling portrayal of Vito Corleone and so is Al Pacino in his\nremarkable portrayal of Michael Corleone. The grandeur of Don Vito\nCorleone ironically lies in his austerity and inexorable equanimity.<br><br>The grandiosity of the movie is such, that even the biggest complement\nmade about it may sound like a picayune remark. The Godfather may most\naptly be described as an obituary of humanity, a requiem of mankind,\nowing to the pervasive violence and the brutality that it portrays in\nan utmost sanguinary fashion. In a nutshell, the movie has transcended\nall the limits of mortality only to achieve apotheosis.<br><br>http://www.apotpourriofvestiges.com/\n"},
{"review": "\nThink epic novel crossed with Mafia speak.<br><br>Imagine excellent cinematography and direction, a great musical theme,\nviolence, tragedy, spectacle, and the family, and a cast which can't be\nfaulted, and here you have a film which fits the bill on all counts.<br><br>Vito Corleone (Marlon Brando in one of his greatest roles, one which he\nsupposedly didn't initially want to play) is the powerful Mafia Don we\nmeet early in the film. He has three sons (Sonny - James Caan; Fredo -\nJohn Cazale; and Michael - Al Pacino) and a daughter (Talia Shire), and\nan adopted son (Tom Hagen - Robert Duvall). These are his beloved\nfamily and the centre of his world. His day job involves building his\nempire by making 'offers you can't refuse'.<br><br>'The Godfather' was the first film in a trilogy following the fortunes\nof the Corleone family, and I think the best. It has some\nwell-presented set pieces (Connie's wedding; Sonny's murder; Michael's\nkilling of family enemies in the restaurant; the horse's head in the\nbed; and Vito's death while playing with his grand-child) and is\nextremely well-written. The novel itself was more soapy, a work of pulp\nfiction - the film pulls it together and gives it a bit more class.<br><br>I particularly like the characterisations of Vito and his sons. Vito is\nassured in his role at the head of the premier Mafia family. Sonny is a\nvain libertine who is hot-headed. Fredo is a weak disappointment.\nMichael takes his place in the family when he has to (in fact\nthroughout the three films he is shown to be far more ruthless than any\nof his relatives).<br><br>Is 'The Godfather' the greatest film ever made? No, but it is one of\nthe best. Certainly in the top 10 films of the 1970s.\n"},
{"review": "\n\nFirst I have to say that it is very difficult to watch this movie for the\nfirst time (which I just did) and approach it with an open mind. The glowing\nreviews it gets everywhere (many of course calling it the best movie ever\nmade) gives one extremely high expectations and the possibility of being\neasily disappointed. The many parodies of the movie also give it a cult\nstatus that makes one think one knows the story even if one has never seen\nit.<br><br>I thought \"The Godfather\" was a good movie, but nothing more than that\nreally. I personally wouldn't call it the greatest movie ever made; not even\none of the greatest. It was good, worth watching once and I'm glad I've\nfinally seen it, but nothing more.<br><br>The portrayal of mob life in the post-war era seemed realistic enough, and\nthe appropriate atmosphere was set. The opening scenes (revolving around Don\nCorleone's daughter's wedding) gave me mixed feelings. I thought the whole\nthing went on too long, but it did demonstrate that Corleone's \"business\"\nnever ended - he was constantly meeting with various people looking for\nfavours rather than being front and centre at the wedding. Brando, of\ncourse, won (and refused to accept) the Oscar for Best Actor for his\nportrayal of Corleone, but I wasn't actually taken with his performance.\nFirst, I really didn't think of him as the Lead Actor. Al Pacino (as\nCorleone's son Mike) was, I thought, far more important to the story and far\nmore interesting to watch. Brando had - to me - an almost cartoonish aura\naround him. Over-rated in my view. But Pacino was excellent, and the\ncharacter of Mike the most interesting in the movie, as he evolves from the\nreturned war hero who wants nothing to do with the family \"business\" to the\neventual \"Don.\"<br><br>It's not that I thought this was a bad movie. It was quite watchable and for\nthe most part very interesting. I just think I've seen\nbetter.<br><br>6/10\n"},
{"review": "\nThe Godfather is not just a crime film, it's much more deeper than\nthat. It's about loyalty, respect and more than anything, it's about\nfamily and real life. The casting in this movie is flawless. Marlon\nBrando as the Godfather is a perfect casting choice. He brings his\nunique style to his character and makes him alive. He's not just acting\nhis role, he's living it, at least that's what it feels like. He truly\ndeserves his Best Actor Oscar. Every scene where he is in and every\nline he says is emotionally touching and breathtaking, and it's not\njust because of his acting, but it's also because of the film's\nmagnificent writing and directing. The storyline is outstanding. It's\nbased on a novel written by Mario Puzo. Francis Ford Coppola did an\namazing job with bringing his story to the screen. He really gave us\nthe best film of all time. Brando wasn't the only one who did a\nwonderful job with his character, because even though Vito Corleone was\nthe key element of the movie, the movie was still mostly about his son,\nMichael Corleone, played by Al Pacino. You can really see his character\ndevelop during the movie, and you can feel the respect that his\ncharacter has toward his father. There's a real connection between\nthose two, even though they have a small number of scenes together.\nBesides Marlon Brando and Al Pacino, there were other supporting roles\nthat were amazing as well, like James Caan as Sonny Corleone, Robert\nDuvall as Tom Hagen and of course the beautiful Diana Keaton as Kay\nAdams. This movie has everything. Good acting, directing, writing,\ncinematography and of course memorable and recognizable music by Nino\nRota. In my opinion, there is only one misstep in this film, and that\nis the lighting in the wedding scene in the beginning of the movie. I\ncan honestly say that this is my favorite movie and if you haven't seen\nit yet, you should watch it as soon as possible! 10/10 Excellent!<br><br>(These are just my quick thoughts about this movie)\n"},
{"review": "\nIncredible!! With the epic soundtrack, characters, plot, casting, and\ndirecting this movie has to be considered THE best of all time.\nAlthough it is one of many Francis Ford Coppola masterpieces, this\nmovie stands apart from the others. By telling the Corleone story from\nthe inside of the family and mafia, viewers easily identify with and\ncare about the characters. The cinematography is amazing too, and some\nof the shots and scenes from this movie can be considered the best of\nany movie throughout time. You can see IMDb's 9.2 rating of The\nGodfather and hear about the movie as often as you want, but until you\nexperience the power of this film yourself, it will be impossible to\ngrasp the importance of the movie to cinema. Although this movie is\nfrom the early 70s, it is by no means dated. Michael Corleone is my\npersonal favorite character of all time, and the chance to see James\nCaan, Robert Duvall, Marlon Brando, Al Pacino, and John Cazale work\ntogether is unforgettable. Nobody could've known that Marlon Brando,\nwith two cotton balls, would create the most famous voice in cinematic\nhistory.\n"},
{"review": "\nSince I was a small boy, whenever I heard of others talking of the\ngreatest movies ever made, The Godfather always came up,most of the\ntime, at the top. I always thought that the movie was overrated, that\nis, until watched it two years ago.<br><br>How to tell if a movie is good? If you can't stop thinking about it, if\nyou keep replaying the characters' lines in your sleep, then the movie\nisn't just good, it's great. The Godfather's impact on the movie\nindustry is incalculable, in almost ever modern gangster movie there is\nat least one reference to it.<br><br>I can find no flaw in this movie. If there were anything such as a\n'perfect' movie, this is it. Coppola provides excellent direction such\nthat though the movie stretches to almost three hours, you won't be\nbored for one minute. <br><br>The highlight of this film is an innovation. The gangsters here are not\nportrayed as mindless monsters but as men with families. We see Vito\nand Michael Corleone as protagonists rather than antagonists. Credit\nfor this goes to Mario Puzo's original source material but let us not\nforget the actors.<br><br>Marlon Brando gives the greatest performance of not only his career but\nof any other actor as the family patriarch. He's so Don-like that you\njust wished you could go to him with all your problems too. Al Pacino\nplays Michael Corleone. But he doesn't give a single performance, he\ngives two. At the beginning, he plays a war hero who doesn't want\nanything to do with the family business. Pacino skillfully shows us\nMichael's transition from this to a cold blooded Don at the end. The\nother actors play their parts well too. In fact, there has never been\nany other better cast than the cast of The Godfather.<br><br>A cinematic masterpiece, this is one for the ages.\n"},
{"review": "\nIt has been said so many times that it seems cliché, but I wil continue\nto say it. The Godfather is one of he greatest movies ever made. Words\ncannot express how well the film combines all the elements a film\nneeds, to be good. The acting is top notch, the cinematography is\nbeautiful, the filming locations and sets are perfect, the sound is\ngreat, the music is excellent... I could talk about how great this\nmovie is for hours. Francis Ford Coppola has a clear vision for this\nmovie, and is expertly brought to life.<br><br>The beginning of the film starts out at the wedding of Don Vito\nCorleone's daughter, Connie. At the wedding reception we are introduced\nto the many of the members of the Corleone crime family, however not\nall of them are part of the \"family business\". At the wedding, Vito's\nyoungest son, Michael, tells his then girlfriend, Kay, that he was not\nlike his family. Throughout the rest of the film, we see Michael\nCorleone transform into the very thing he claims he hates. It's an\nexcellent example of how character growth should be done.<br><br>From the intriguing beginning where we find Vito Corleone being asked\nfor favors, to the climatic ending where Michael finishes his\ntransformation, The Godfather is a landmark film in American cinema.\n"},
{"review": "\nThere isn't a gangster film out there bigger or better than The\nGodfather. It's hard to some it up in a few words, but here goes. At\nthe centre of this film is the family. The Corleone family, headed by\nVito (Marlon Brando), a.k.a. The Don, or The Godfather. His daughter's\nwedding tells us all we need to know about the Corleone's; key\nindividuals, small but incredibly thought out sub-plots and a running\ntheme of business and personal matters never mix. <br><br>The Godfather is based on the simplest of foundations. Love thy family.\nThink before you act. Never betray your own. Vito attempts to keep the\npeace between the crime families. When things go south Vito's youngest\nson Michael (Al Pacino) gets involved. Michael's innocence is torn\napart as he takes control of the family business.<br><br>With every view comes a new discovery, a piece of the puzzle missed the\nlast time round. The Godfather is a labyrinth waiting to be deciphered.\nBrando is sublime. He's able to radiate warmth and coercion with the\nsmallest of reactions. It sets up careers for James Caan and Robert\nDuvall, who're brothers with dissimilar attitudes. The best is to come\nfor Pacino, as this first part in a trilogy only shows his potential.\nThe Godfather is a one of the most intense gangsters films you're ever\nlikely to see.\n"},
{"review": "\nThis film contains all the elements of a genuine masterpiece. Its\nattention to detail, history, and tradition. An absolutely wonderful\nscreenplay. Its comparative closeness to the novel and a storyline\nwhich became the template for future stories in this genre. As for the\nperformances: there is not one single character flaw in this entire\ncast. What continues to amaze me about this film more than any other is\nthe fact that not only were the correct actors and actresses chosen for\nthe roles but that they were each chosen at the perfect point in their\nrespective careers. Throughout this film, there is not one actor nor\nactress who seems \"too old or young for the part\". Nor does anyone\n(including an extremely strong Diane Keaton) seem \"out of place\" or\n\"unconvincing\". The plot and storyline could not have been better and\nthis is one film that no matter how many times you've seen it, it still\ncontinues to amaze, entertain, and (in some ways) inform. Like some of\nthe classics which preceded it, it holds up very well over time and\nwill probably continue to do so. I currently own on VHS \"The Godfather\nSaga\" (the first 2 movies woven together in chronological order) which\nis absolutely amazing. It begins with the birth of Vito and ends with\nthe eventual rise of Michael. Although Francis Ford Coppola does not\nlike this version of his epic, I sure wish he would release it on DVD.\n"},
{"review": "\nThe Godfather is one of the most iconic films in cinema history. There\nare three points in the film that made it stand alone: direction,\nacting, and writing. <br><br>The direction of this film was great! Frances Fran Coppela really knows\nhow to make a great film. Like Steven Spilberg, Peter Jackson, James\nCameron, and so many others, he as list himself as one of the most\ngreatest directors in Hollywood. He's my role model. <br><br>The acting was terrible, just kidding! :) The Acting was amazing.\nMarlon Brando carries the anchor of this movie, but Al Pacino holds it\ncarefully. The cast of this movie was a good example of cast chemistry.\nGreat Cast! <br><br>The Writing was awesome. Coppela knows what he is doing when he is\nwriting a script to a major blockbuster hit. That's why he's my role\nmodel. <br><br>The Godfather is one my favorite films of all time. I would recommend\nyou see this movie. It's awesome.\n"},
{"review": "\nOK, I see that the movie has many naysayers. I was one of them when I\nsaw the film in 1972, and I was only fifteen at the time. I could go on\nand on about the film's myriad failures. It is contrived,\nself-important, at times even poorly staged. Which brings me to my\npoint. A lot of people seem to forget that Coppola did not win Best\nDirector-- Bob Fosse (for \"Cabaret') did, and deservedly so. He did a\nmuch better job. That is one of the eight Oscars that \"Cabaret\" won.The\nother seven just happen to be Art Direction, Cinematography, Sound,\nEditing,Original Score, Best Supporting Actor, and Best Actress. So\nwhen the time came to open the envelope and announce Best Picture, the\nAward goes instead to a film that, by that point, had won only two\nstatues (for Actor and Adapted Screenplay). How does any movie win\neight Academy Awards and fail to grab Best Picture? With that in mind,\n\"The Godfather\" is not merely arrogant film-making. Its history and\nlegacy,both--just like its protagonists-- are just downright larcenous.\n"},
{"review": "\nI never liked the IMDb top 250 list. So i haven't thought about this\none for a very long time. Then i watched Shawshank and immediately\nbecame a fan. Somewhere i read that Godfather was at the top of the 250\nbefore Shawshank and that's when i decided to take a chance with\nGodfather. <br><br>I wasn't a fan of gangster flicks so it's fair to say i never thought\ni'd sit through all 3 hours and minutes. What can i say? This film\nchanged every thing about my taste in movies. After watching this i\nended up as a fan of gangster movies and i went on to watch some pretty\nold movies and some of the longest running films. (And now i am a fan\nof IMDb's 250)<br><br>I had a go at this movie again (for the 5th time)yesterday and\ncompelled to write a review here.I'm not gonna say anything new here\nafter all these 1687 reviews but anyone reading this i guess you\nprobably watched the movie and inspired enough to read the reviews\nhere. If that so give me a thumps up! <br><br>In my opinion The Greatest Gangster Film ever. And Arguably the\ngreatest movie of all time. 10 out of 10.\n"},
{"review": "\nMarlon Brando's acting as the Godfather is sublime and this film is\nworth watching for that.<br><br>However I did find the film very long-winded and at times boring. I\nliked the slow progression of the storyline and understand why Francis\nFord Coppola did the film in the way he did. It's just that I felt the\nfilm was lacking something. It could have done with a bit more\nexcitement or suspense to make the film more gripping.<br><br>Lets just say I watched this film about a year ago and I still haven't\nseen The Godfather 2, and I am in no hurry to either.<br><br>7/10. Average film. Worth watching to say that you have seen it.\n"},
{"review": "\nUp until today, I haven't bothered to review \"The Godfather\". After\nall, everyone pretty much knows it's one of the greatest films ever\nmade. It's #2 on IMDb's Top 100. It won the Best Picture Oscar. And,\nthere are nearly 1600 reviews on IMDb. So what's one more review?!\nWell, after completing 14,000 reviews (because I am nuts), I guess it's\ntime I got around to reviewing a film I should have reviewed a long\ntime ago. So, here goes....the film is perfect and only a dope wouldn't\nwatch it. Unfortunately, IMDb requires me to say more to meet it's 10\nline minimum for reviews. So, I'll point out that you do NOT need to\nlike gangster films to enjoy this film. Yes, it's violent and nasty in\nspots--but it's also brilliantly written and produced from start to\nfinish and deserves the accolades it's received.<br><br>My advice is that instead of just watching \"The Godfather\" and \"The\nGodfather: Part II\", see the combined version they created for\ntelevision--with additional scenes that made it a very rich experience.\n"},
{"review": "\n\nSpoilers herein.<br><br>Building a life in film is not so much a matter of discovering the\nworthwhile films, but choosing which of those have the stuff worth building\nwith. I have a clear understanding of what Scorsese is about, which I\nattribute to the Latin convention for storytelling. This convention is\ntotally invested in characters, not situation or place or God help us,\nideas. Scorsese's camera is attached to people, never place. His curiosity\nis always about people. This is a form of visual gossip that I\neschew.<br><br>So it is with Coppola. But his two projects (the Godfather and Apocalypse\njourneys) have another merit in how they work with what came before.\nApocalypse is far more interesting in this respect. But `Godfather' is very\nclever in how it places itself. Gangster pictures began as a matter of a\npretend world, and became ever more so as the genre matured. Mobsters lived\nin a world not unlike that of the Roadrunner,  always at a distance from\nreality, often winking at the audience.<br><br>Coppola took his focus on the human to this genre. The film itself is no\nmasterpiece without this placement, but is great with it. We inherit all the\nmachinery and momentum of the genre to place behind the characters. Brando\nunderstood this, and alone is able to effect the transferral. Pacino would\ngo on to sledgehammer his roles, but is appropriately subdued\nhere.<br><br>Ted's Evaluation -- 3 of 4: Worth watching. \n"},
{"review": "\nThere is always a risk when a film becomes a huge part of popular\nculture. So many of it's iconic moments and scenes are ripped off,\nriffed on, or parodied by countless shows and movies, that there is\nalways a fear that the original will lose some of it's impact, and\nbecome comical and stale. <br><br>The Godfather, however, disproves this. It is still a masterpiece, and\nalways will be. The story-line proves once again how much the innocent\npublic loves to view the lives of outright evil men, especially when\nthey happen to be of the charming and charismatic variety. Let's look\nat the most iconic scene; a man chops off a horse's head, and leaves it\nin his owner's bed in order to scare him into submission. Oh yeah, he's\none of the good guys though, so it's okay!<br><br>Everything is explored in the Godfather, either directly or subtly;\nfamily politics, gangland negotiation, corrupt officials, there is no\npart of the mafia experience that is not pictured here, taken from the\nviewpoint of Michael, a character whose transition from unwilling\nfamily outsider and war-hero into the don himself really gives the film\na unique perspective. <br><br>Of course, for me, out of all the fantastic characters, the film is\ncarried by Marlon Brando. There is something magnetic about his\nperformance, a mixture of loving family man, ruthless career criminal,\nand sophisticated Sicilian gentleman, that is thrilling to watch. One\nof the all time greatest acting performances.\n"},
{"review": "\nThe Godfather used to hold the top spot in IMDb's Top 250 movies list;\nit now sits at number two, behind Frank Darabont's emotionally\nmanipulative crowd-pleaser The Shawshank Redemption, which has become\nthe go-to title for people who can't be arsed to think for themselves\nwhen it comes to naming their favourite film. People clearly aren't\nshowing The Godfather enough respect (perhaps they need to be taught a\nlesson, capiche?).<br><br>In my opinion, Francis Ford Coppola's sweeping Mafia epic (based on\nMario Puza's bestselling novel) trumps Shawshank in every way\u0085<br><br>The film boasts a superior cast headed by Marlon Brando and Al Pacino,\nwith excellent support from James Caan and Robert Duvall; Tom Robbins\nand Morgan Fairchild are simply no match.<br><br>Coppola's storytelling is impeccable from start to finish, drawing the\nviewer into the film as inextricably as Michael Corleone (Pacino) is\ndrawn into the sinister, violent underworld of Sicilian organised\ncrime. Darabont does a reasonable enough job at papering over\nShawshank's plot holes, but fails to lend his film the sense of style\nand class so evident in every scene of the Godfather.<br><br>Nino Rota's score for Coppola's movie is sublime, a majestic piece of\nmusic so emotive that just a few notes evoke an entire genre. I can't\neven recall Shawshank's score.<br><br>Rather unsurprisingly, The Shawshank Redemption deals with the theme of\nredemption, and closes with a contrived feel-good ending. The Godfather\nis darker and far more complex, dealing with loyalty, honour,\nobligation, destiny, desire, vengeance, violence, love, hate, and\ntrust; it doesn't sell-out with a sappy, happy ending, closing instead\nwith Michael embracing the lifestyle that he once sought to avoid.\nPerfectamundo (that's Italian for 'perfect'. Possibly).<br><br>In short, The Godfather is the don in every department.\n"},
{"review": "\nI cannot think of a single negative of the Godfather. It truly is a\nclassic and will always be one of the greatest films ever made. I have\nseen it many times and recently purchased the movie so that I could\nwatch it anytime that I want. <br><br>I love the score for this film and get goosebumps when I hear that\nopening trumpet begin to play. As the movie progresses I begin to feel\na connection to the characters and become invested in their growth and\nstory. As many times as I have seen this movie, I continue to have the\nsame feelings. It is one of the movies that can never get old and will\nalways be a masterpiece. <br><br>It will be a number of years before anything can come close to the\nmagnitude of this film and it may never be contested.\n"},
{"review": "\nWhat a brilliant film. It is one of my favorites. The aging patriarch\nof an organized crime dynasty transfers control of his clandestine\nempire to his reluctant son. I love this film All of my family loves it\nMy girlfriend loves it. I think it is one of the best films ever. It\nstars many actors such as Marlon Brando and Al Pacino. It is one of the\nmost greatest films of all time. I have it on DVD at home and the\nSoundtrack at home.<br><br>The Godfather is a 1972 American crime film directed by Francis Ford\nCoppola and produced by Albert S. Ruddy from a screenplay by Mario Puzo\nand Coppola. Starring Marlon Brando and Al Pacino as the leaders of the\nfictional Corleone New York crime family, the story spans the years\n1945\u009655, concentrating on the transformation of Michael Corleone from\nreluctant family outsider to ruthless Mafia boss while chronicling the\nfamily under the patriarch Vito.<br><br>Based on Puzo's best-selling novel of the same name, The Godfather is\nwidely regarded as one of the greatest films in world cinema and as one\nof the most influential, especially in the gangster genre. Ranked\nsecond to Citizen Kane by the American Film Institute in 2007,it was\nselected for preservation in the United States National Film Registry\nof the Library of Congress in 1990 as being \"culturally, historically,\nor aesthetically significant\".<br><br>The film was the box office leader for 1972 and was, for a time, the\nhighest-grossing picture ever made. It won three Academy Awards for\nthat year: Best Picture, Best Actor (Brando) and in the category Best\nAdapted Screenplay for Puzo and Coppola. Its nominations in seven other\ncategories included Pacino, James Caan and Robert Duvall for Best\nSupporting Actor and Coppola for Best Director. The success spawned two\nsequels: The Godfather Part II in 1974, and The Godfather Part III in\n1990.\n"},
{"review": "\nWhat's to say about this movie that hasn't been said already. Pure\ncinema magic. The casting is superb, the character development is\nsuperb, the acting is first class, coupled with the legendary\nsoundtrack a true masterpiece.<br><br>From the script to the whole dialogue and interactions between the\ncharacters the attention to detail is stunning and I wish more modern\nmovie makers would take the time to build and develop the characters\nlike this movie does.<br><br>From the opening scene, when Bonasera is looking for revenge for the\nbeating of his daughter, to the closing scene when Kay sees Michael\ncrowned as the Don and Neri closes the door, the movie just flows\nseamlessly from act to act. Coupled with the legendary soundtrack<br><br>The scene where Sonny, Michael, Tessio, Hagen and Clemenza are\ndiscussing hitting Solozzo is pure gold. As they all sit around\nnonchalantly discussing murder, before Michael pipes up and tells them\nhow if they arrange a meeting he will kill them both is so just so well\nacted, that you actually believe these guys are gangsters.<br><br>A real example of great story telling transferred to film.\n"},
{"review": "\nThe Godfather movie series is the best that I have ever seen. It's\nreally joy and fun and exciting to watch the movie all over again. I\nreally enjoy the first part the most, but I think the second part is\nvery interesting and adds lots of elements to part one. I wish the\nGodfather was a whole new TV series, that dose extend beyond three\nparts. I enjoy the excellent acting, story, and drama. I can't say\nenough about the music. It's something that many people enjoy listening\nto on regular bases. Overall I would rank this movie top notch on my\nlist. Highly recommended. have seen The Godfather movies too many times\nto count. It's part of the lexicon in my family, we quote lines from it\nall the time in regular conversation. So, I thought this book might be\na little boring, just because I already knew the story so well. Not the\ncase! The book adds so much detail to the story that I think I'll be\nwatching the movie again soon in a whole new light. Joe Mantegna does\nsuch a wonderful job narrating this story and I'd absolutely recommend\nhis version as opposed to the other full cast version that's out there,\nespecially for people that are really in tune with the movie.\n"},
{"review": "\nNo one ever brings up a big detail about this movie: It's plain, the\nstory goes on straightly, it's SIMPLE. The genius isn't something\nover-complicated and weird in an awful movie, it's something simple\nturned into a masterpiece. Everything is just perfect, the acting, the\ndialogues, the characters and their evolution (even (rare) stereotypes\nwork perfectly and they fit with the atmosphere), the shots, the\ncinematography, the music that not only fits but it's never\ndistracting... It's not something particular that made this movie\ngreat, it's the perfect chemistry between the elements. It's slow but\nnever boring. It's better than the book, in fact (at least for me). So\nthis is my little tribute to one of the greatest movie ever, and this\nis only my point of view.\n"},
{"review": "\nFirst time i saw this movie i did not understand the actual realty of\nmovie and characters acting was speech less. Rest i can said when i saw\nand understand this movie after my 5th 100% successful attempt to watch\nfull movie then i realize this was the awesome movie i need to buy\noriginal, and well be in my personal collection . Currently my family\nand my friends also buy the original blue ray of this movie very hard\nto find a seller because all want this one to their collection part.<br><br>fabulous acting, superb story and played with characters am speechless.\nWe all knows we well not again see to like this kind of level of movie\nin any decades hats off to all super actors in the movie.\n"},
{"review": "\nThe movie is phenomenal, is rightly considered one of the greatest\nfilms ever made. The Godfather continues to influence producers of\nfilms, television shows, and video games more than 30 years after its\nrelease. <br><br>It takes its subjects seriously, bestowing legitimacy upon the\ninternecine power struggles of the Mafia normally reserved for\nclassical themes in high art. There is something deeply resonant in the\nfilm's treatment of filial piety, the need for respect, and our\nculture's abiding interest in the parallel moral universe of the Mafia.\nJust the best.\n"},
{"review": "\nThe Godfather is the definitive mafia film and it really stands the\ntest of time, being one of the finest films ever made. Francis Ford\nCoppola not only explores this whole underworld ruled by different\ncrime lords, but also analyzes the dilemmas and intrigues that exist in\nthe Corleone family and all the people that surround it. You realize\nhow every character here is crucial to the story at some point. There\nis a huge amount of suspense in many occasions and the scenes where\nsomeone gets executed can be quite abrupt, being always thrilling. What\nI liked the most about the story was seeing how Michael Corleone slowly\naccepts his destiny, making really tough decisions and becoming a\ncompletely different person by the end of the film.<br><br>All the cast provide top-notch performances, specially Marlon Brando as\nDon Vito Corleone. He owned that role as this aging patriarch and head\nof one of the most powerful mafia families in the area of New York in\nthe 1940s. Every time he was on screen, I felt compelled by what he was\nsaying. Don Vito is just very rich as a character as he values respect\nmore than anything, being always eloquent and caring towards others. Al\nPacino gives a very nuanced performance as Michael Corleone, one of Don\nVito's sons. Following his transition as a character was truly\nremarkable. The final moments in the film reflect that in a very\npowerful and intense manner. Finally, I have to say The Godfather\ndefinitely has one of the most beautiful scores I've ever heard.\n"},
{"review": "\nFrancis Ford Coppola directs this masterful, brilliantly acted(Marlon\nBrando, Academy Award winner, Al Pacino, James Caan, Talia Shire, Diane\nKeaton, Robert Duvall among many others) and supremely well-crafted\nfilm about the saga of the Corleones, a Mafia family who find\nthemselves in changing times, and their struggles to adapt. Aging Don\nVito Corleone must pick a successor, but a violent war among a rival\nfamily, and betrayal from within, threaten to shatter this close-knit\nfamily.<br><br>Long, but not over-long, this moves at a fantastic pace, and is among\nthe most engrossing films ever made, many memorable scenes and lines.<br><br>A masterpiece.\n"},
{"review": "\n\"The Godfather\" has long enjoyed a reputation as one of the greatest\nfilms of all time. Is that a fair assessment? After re-watching the\nfilm recently, I'd say yes.<br><br>The 'godfather' of the title is Don Vito Corleone (Marlon Brando), the\naging head of the Corleone crime family. His time is coming to an end\nand some of his rivals would like to precipitate that end. When an\nattempt is made on the Don's life his sons follow in their father's\nfootsteps as they seek to silence their enemies and protect the family\ninterests.<br><br>The Oscar-winning script was co-written by director Francis Ford\nCoppola and Mario Puzo, the author of the original novel. While trimmed\nsignificantly from the novel the film still clocks in at two hours and\nforty-five minutes. The film progresses at a stately pace and features\ncountless classic scenes.<br><br>Coppola's direction received a well-deserved Oscar nomination and so\ndid Nino Rota's score (at least until it was deemed ineligible). Gordon\nWillis' cinematography is good (but not great) and the film's evocation\nof the 40's &amp; 50's is both attractive and authentic.<br><br>As for the actors, Marlon Brando was rewarded with his second Best\nActor Oscar for his iconic portrayal of Vito Corleone. Al Pacino was\nnearly as good in his role as Vito's youngest son but he had to settle\nfor a nomination in the supporting category. He had good company,\nthough, since James Caan and Robert Duvall were also nominated. Any one\nof these three performances would have been Oscar-worthy. There were\nalso several memorable performances in smaller roles from the likes of\nJohn Cazale, Talia Shire, Sterling Hayden and others.<br><br>Is \"The Godfather\" the best American film of all time? Personally, I\ndon't think so but I wouldn't rank it too far from the top. In any\ncase, this is one of those films that every movie lover should see.\n"},
{"review": "\nCoppola's near perfect masterpiece. A first class cast including, James\nCaan, Al Pacino and heavy weight Marlon Brando to name a few. There is\nnot much I can add that hasn't already been written, it frankly is the\nquintessential family, Mafia gangster film.<br><br>The 1950's nostalgic feel is captured, distinguished cinematography by\nGordon Willis and the script honed. The costumes, locations and sets\nadd to the overall authentic experience. Brando's aged make-up is\nincredible, particularly for 1972 and apart from some insignificant\nchoppy editing and stock footage the film is near enough picture\nperfect.<br><br>Timeless, compulsive viewing, there is a reason why The Godfather is on\na pedestal as one of the greatest movies or of all time\u0085 There is no\noffer to refuse, it's a must see.\n"},
{"review": "\nRarely can it be said that a film has defined a genre, but never is\nthat more true than in the case of The Godfather. Since the release of\nthe 1972 epic (which garnered ten Academy Award nominations and was\nnamed Best Picture), all \"gangster movies\" have been judged by the\nstandards of this one (unfair as the comparison may be). If a film is\nabout Jewish mobsters, it's a \"Jewish Godfather\"; if it's about the\nChinese underworld, it's an \"Oriental Godfather\"; if it takes place in\ncontemporary times, it's a \"modern day Godfather\".<br><br>If The Godfather was only about gun-toting Mafia types, it would never\nhave garnered as many accolades. The characteristic that sets this film\napart from so many of its predecessors and successors is its ability to\nweave the often-disparate layers of story into a cohesive whole. Any of\nthe individual issues explored by The Godfather are strong enough to\nform the foundation of a movie. Here, however, bolstered by so many\ncomplimentary themes, each is given added resonance. The picture is a\nseries of mini-climaxes, all building to the devastating, definitive\nconclusion.<br><br>Rarely does a film tell as many diverse-yet-interconnected stories.\nStrong performances, solid directing, and a tightly-plotted script all\ncontribute to The Godfather's success. This motion picture was not\nslapped together to satiate the appetite of the masses; it was\ncarefully and painstakingly crafted. Every major character - and more\nthan a few minor ones - is molded into a distinct, complex individual.\nStereotypes did not influence Coppola's film, although certain ones\nwere formed as a result of it.\n"},
{"review": "\nOne of the best movies I have ever see, and I love it everything about\nthis movie. Nothing in this movie is too much, every scene in the movie\nis perfect. The movie is with best cast ever, best directing, good\nstory. It is about crime, family and their relationship. The best thing\nabout it is that movie don't have any flaw. The best way to describe it\nis with word MASTERPIECE. When movie is in parts I, II ... often only\nfirst part is good and others bad, but it is not case with this movie.\nIt's 40 years old movie, and still one of the best, I thing that\ninformation tells a lot. Don't miss this movie, because most of you\nwill watch it again and again. :D\n"},
{"review": "\nThis has to be a masterpiece for me and for my understanding and\nknowledge. I adore mob films like this one and TV series about the mob\nas the great TV series I've ever watched: The Sopranos. The shooting of\nthe whole film is sublime, and the shots of the two sequels as well.\nCoppola got to manage this as a master of film composing. The plot and\nthe development in general is majestic too. The scene of the head horse\nin the film director's bed is very shocking; I never saw something like\nthat. Now I can only say that this has become one of my favorites films\never (for me and for most of you who are reading this). This is the\nsort of films that I would watch for many times.\n"},
{"review": "\nThe Godfather Has One Of The Best Performance Ever By Marlon Brando and\nAl Pacino there's a reason why this film has a 9.2 on IMDb because it's\namazing one of the best movies ever made. Great Cast, Great Director\nand Great Dialogue the film remains on the top after so many years. The\nFather and Son relationship grows more as the film continues and\nthere's a lot of character development the rest of the cast does a\ngreat job as well Talia Shire, James Caan and Robert Duvall if people\nlove this kind of movies with Gangsters and great acting then The\nGodfather is the right movie for you and still the best in The\nGodfather Trilogy. Final Verdict: 10 out of 10\n"},
{"review": "\nThe first Godfather movie may be over 43 years old but still holds up\nwell after all of these years. The film is at heart a story of family.\nIt is the story of Vito Corleone and his three sons, Santino (Sonny),\nFrederico (Fredo), and Michael. It is also the story of Vito's other\nfamily, the mafia. The story focuses on Michael, the youngest son. At\nfirst, he wants nothing to do with the family business but as the film\nprogresses, he is drawn more and more into it and by the end, he is\nrunning the family - both families. The transformation of Michael from\nfamily outcast to Godfather is fascinating to see. Al Pacino does a\nwonderful job of transforming from playful young man to fearsome\ngangster. Without going into too much detail so as not to ruin the\nmovie for those few who have never seen it, several scenes stand out:\nThe horses head is probably the most famous, or infamous, and has been\nused in homage and parody by many others in the years since the movie\nwas released. When I rank the best movies I have seen, the original\nGodfather is always number one on my list.\n"},
{"review": "\nNo one can deny this movie being one of the (if not THE) greatest\nmovies ever made. It is brilliant. Great performances by an amazing\ncast (that was controversial among the studio), beautiful music,\nbrilliant directing of course, cinematography to die for and a\nstoryline that fascinated me from the very first to the very last\nminute. The movie goes deep into the family and lets you be part of a\ndramatic journey. I would definitely recommend this movie to ANYONE. It\nis one of my all time favourite movies and I can watch it over and over\nagain, finding more and more beauty in it every time. It is sad that\nmany friends my age have never seen this movie.\n"},
{"review": "\nGreetings from Lithuania.<br><br>To call \"The Godfather\" a masterpiece or a classic would be\nunderestimating. This is simply put, one of the very best (if not the\nbest) motion pictures ever created. I saw this movie 3 or 4 times, and\ni never get tired of it. After some time passes, you kinda feel a need\nto revisit it again.<br><br>There isn't anything new that i could say about this picture that\nwasn't said before countless times. Everything works here on such\nlevel, that it creates this rich, deep and unforgettable world. From\nwhole trilogy, Part 1 is my favorite by a mile. 2nd and 3rd movies are\ngreat in their own terms, but first one is another level.<br><br>Acting, directing, writing, music (the music!), set design - it's a\nthing of beauty and admiration to a movie crafting art.<br><br>Overall, because you have probably already have seen this masterpiece,\nI can only recommend it to not forget it for a long time and revisit it\nonce in a while. It contains everything that an educated cinema-goer\ncan wish. The unforgettable and one of the kind motion picture, which\nprobably like a great wine just keeps getting better with years.\n"},
{"review": "\nI love this movie. It's the greatest movie I ever seen in my life.\nEvery time I watch it I see something new. It has drama, action and\neven comedy. The story is great. It centers around the most powerful\nNew York mafia run by The Godfather. It teaches you about family and\nbetrayal, about life in general. All that Michael does is for his\nfamily. He even sacrifices his relationship with his girlfriend to\nprotect his family. The movie is amazingly shot, giving it amazing\nlight. The characters are bigger than life and played by some of the\ngreatest actors to ever live. The soundtrack is very good. All in all\nis must see.\n"},
{"review": "\nExcellent film, from the opening to the end you sense a genuine touch\ninto lives of the characters and the world created by the actors and\nCoppola.<br><br>Just the intro of the movie immediately reveals the world you've\nentered and in the next few scenes you familiarized with family which\nshows who they are at heart.<br><br>Personally, I love a movie that takes the time to deliver a well told\nstory and The Godfather does just that - the scenes revealing the inner\nstruggles of the characters, the conflict in matters regarding their\nworld, and how each character deals with issues is well done.<br><br>When a movie makes all their scenes have significant impact so much so\nthat you don't find yourself wanting to pick favorites, you know you're\ndealing with greatness.<br><br>From beginning to end I was immersed, and if you like well done movies\nI'm sure you'll experience the same.\n"},
{"review": "\nSo at first I always heard from a lot of people when I was younger that\nGodfather was the most epic movie of all time, I always memorized Vito\nCorleone's face when I was a kid... Years later I decided it's time I\nwatch this movie and I did it on Netflix. Oh, and when I did, it was so\ngood...<br><br>The sharp chemistry is what makes up most of the stuff, these actors\nalways just transcend and transcend so much. Vito Corleone is one of\nthe best movie characters ever. And the performances? These actors gave\none of the best performances of all time. Al Pacino as Michael Corleone\nis arguably his best performance ever. I can't say enough of Marlon\nBrando. Do I need to state the obvious? He is the best for a reason. I\nwould go on forever on Godfather and why it is my favourite movie of\nall time, but that would be more than 1,000 words. If you haven't\nwatched this, give it a try and see to yourself - a masterpiece.<br><br>What ALSO makes the godfather so special is it's line of who is a hero\nand a villain, can one really call a calm guy like Vito Corleone a bad\nguy? Technically he should be because, well because.. He is, a good...\nbla bla bla, it all just goes into your mind and it challenges you. I\nalways saw Vito as a hero, but as Godfather grew more on me, I thought\nhe was more like an Anti-hero. As for Michael, he will always be an\nanti hero in my opinion. Godfather gives out the most blend and epic\ncharacters in fiction history ever, let alone movies.\n"},
{"review": "\nThis type of movies which you get to watch over and over again without\ngetting bored of it, they way it has been scripted, acted, produced and\ndirected is really attractive and amazingly catching your breath, it\nhas a lot of life lessons to learn from no matter what do you do in\nyour life, it also shows the importance of family bonding and keeping\nit all balanced. I'm convinced that I will never ever get to watch a\nsimilar movie to this one with this brilliance in every aspect, I don't\neven believe that if there would be anyone on this earth who has never\nsaw the Godfather Trilogy, it is absolutely highly recommended, but of\ncourse its not suitable for the little kids, it has lots of violent\nscenes, hopefully we'll get to see more and more of these awesome\ntitles.\n"},
{"review": "\nI have rated over a 100 movies in IMDb and none of them could get a\n10/10 score, but this. I think that perfect score was waiting for me to\nwatch this movie. This movie that has set a benchmark for me to rate\nother movies, \"Is it The Godfather level good or not ?\".<br><br>This movie for me is an epitome of perfection, it scores a perfect\nscore in almost all the departments, be it direction, acting, music,\nscreenplay, character development, cinematography etc. I just couldn't\nfind a fault with it (and mind you I tried really hard).<br><br>With a blazing canon of actors which include Marlon Brando, Al Pacino,\nJames Caan, Robert Duvall this film pierces right through you and makes\na place for itself. Even days after you watch this movie you will find\nyourself, in your own private moments, speaking out those wonderful\nlines, trying to copy Vito Corleone or shape your voice like Michael\nCorleone. In its own mysterious ways the movie will sure remain with\nyou.<br><br>It leaves you wanting more, not because there are questions that remain\nunanswered, but because this film feels so good that you never want to\nleave it, leave the streets of New York or the Godfather's mansion. <br><br>All in all Francis Ford Coppola has done a remarkable job that, in the\nleast, deserves a standing ovation and an unanimous cheer of \"Bravo!\".\nThis movie leaves you with an aftertaste of knowing that you have\ncherished watching an excellent movie.\n"},
{"review": "\nThis was a classic for me when I saw it for the first time, later I\nmade all of my family watch it, we became true la Familia ;) not really\na crime syndicate, but rather we loved what we saw in this film. I\nthink this one is the best of the three parts and it is a timeless\nclassic.<br><br>I think Marlon Brando really deserves the Oscar for his role in this\nfilm, just as the film deserves other Oscars that it won.<br><br>It is hard to add more laudeamus about this film that has already been\nwritten, I will let you read other reviews which I read which makes it\nso interesting to read. I will leave you with a question. How much of\nthis could happen in the real life? I will leave you to wonder.\n"},
{"review": "\nThe few \"perfect\" films to ever been released are so perfect in every\naspect that each scene almost feels like a masterpiece on its own. In\nthe case of Coppola's revolutionary The Godfather, this statement holds\nespecially true. Phenomenal and sheer brilliance in every aspect that\ncannot be matched by modern \"cinema\", Coppola's The Godfather is\ncinematic perfection in every aspect of filmmaking. From performances\ndelivered by an astounding ensemble cast, to Nina Rota's breathtakingly\nsoaring and epic musical score to Coppola's very direction, The\nGodfather should essentially be viewed as a three hour masterclass on\nfilmmaking for any aspiring filmmakers. So perfect in every aspect and\nso free of flaws, no film since its time has matched even half the\nbrilliance of The Godfather.\n"},
{"review": "\nIt's hard to find a moment in the film that isn't great. The Godfather\nlives up to the term masterpiece. A defining film in the history of\ncinema, \"The Godfather\" introduced a legendary filmmaker and several\nacting greats in the telling of an Italian American dynasty undone by\nthe tragic circumstances of their criminal exploits. \"The Godfather\" is\nhighly regarded as the greatest American movie of all-time. No other\nmovie has garnered such praise as this movie has. Undoubtedly,\neverything has been meticulously put together to create an\nentertaining, captivating, and phenomenal masterpiece. Starring the\nbest actor of all times (this movie can prove it), Marlon Brando, the\nrebellious prodigy, who electrified a generation and forever\ntransformed the art of screen acting.<br><br>You can't miss this movie.\n"},
{"review": "\nFrancis Ford Coppola's The Godfather (1972) is undoubtedly one of the\nbest movies ever made because to me it was a pitch perfect mafia film\nthat definitely compares to the greatness of Scorsese's GoodFellas\n(1990), and Arthur Penn's Bonnie and Clyde (1967) but so much better\nthan those two great films put together. The best summary for this film\nwould be about an aging mob boss named Don Vito Corleone (played by\nMarlon Brando in an Oscar winning performance) who in a few years time\nis going to retire from his position as Godfather and pass the Corleone\nfamily leadership to his reluctant war hero son Michael (played by Al\nPacino in a performance that should have won him the Oscar as 1972s\nbest supporting actor). Besides GoodFellas and Bonnie and Clyde having\nthe most obvious thing in common with this film is that all three films\ntalk about the mob, and the second thing that all three films have in\ncommon is that they give people who watch them how ruthless the mob can\nbe in real life. Though I didn't read the Mario Puzo novel I understood\nthis film perfectly thanks to all the perfectly acted performances by\nBrando and Pacino, but as well as Robert Duvall as the family lawyer\nTom Hagen, James Caan as Sonny, as well as John Cazale as Fredo.\nCoppola's film not only depicts how ruthless the mob can be in some\ninstances but also how violent the mob can be as well as those were the\nperfect requirements for movies like this. The one thing I really\ndisagreed with most with the 45th Oscar ceremony is why Marlon Brando\nrejected his 2nd academy award for lead acting when in this movie he\ngave the best performance of his entire since A Streetcar Named Desire\n(1951) and On the Waterfront (1954), and as to why Francis Ford Coppola\ndidn't win the Academy Award for best director when I really do think\nhe deserved it. But in the end this film is an absolute masterpiece\nfrom start to finish.\n"},
{"review": "\nThe Godfather is an endless movie. No matter the age in which it has\nbeen discovered or the number of times you have seen it, this is a work\nthat does not lose its ability to fascination and mystery. The problem\nis how to talk about it not limited to the amount of praise that his\nexpertise justifies either the wonderful performance of Brando as Don\nVito Corleone is evoked (note modulation of dialogues and play with the\ncat in the three interviews of the first sequence: all his character is\ndefined), the tormented role Pacino as Michael Corleone (is a war hero\nwho works they require to take their place in the crime family), the\nimpulsive character of James Caan, with its counterpart in reflective\nTom Hagen who plays Robert Duvall or accuracy of the smallest side,\ncorresponding to names as Italian as Sollozzo and Tattaglia.<br><br>The ribbon structure wise, it does not feel his nearly three hours, is\nalso exemplary. It could be considered that The Godfather is organized\naround collective sequences religious-family: marriage of Connie (the\nonly sunny sequence of the film to the Sicilian intermediate achieved),\nthe justly celebrated baptism-slaughter, disease and death (the Don\nVito was playing with his grandson among the vines, is another\nanthology moment) and the rest comes down to await the arrival of the\nviolence, unrelenting brutality from the shooting of Sonny at the foot\nof the house (a tribute Coppola to Arthur Penn's Bonnie &amp; Clyde) to the\n\"premiere\" of Michael in the restaurant. There riddled bodies, stabbed,\ndismembered, strangled or blunt: a kind of feast of degraded meat,\nwithout which there is no mafia \"order.\"\n"},
{"review": "\nThe Godfather, for the few of you who don't already know, is about the\nCorleone mafia family struggling to survive a war with a rival family.\nThat's about as simplistic a summary as you can get for this\nmasterpiece. There's no way to describe it in a few simple lines and\nthere's already a ton of excellent, well-thought-out reviews here on\nIMDb. There's really very little I can add to the overwhelming praise\nfor this film. It's obviously one of the greatest movies of all time\nand its reputation as such is well-deserved. The direction, the cast,\nthe score, the script are as good as it gets. The whole production is\nas flawless as you're likely to find on any film. There isn't a thing\nabout it I would change. It's one of those movies you have to see at\nleast once before you die.\n"},
{"review": "\nTHE GODFATHER is quite simply a masterful piece of film-making, an epic\nin the truest sense of the word and by far the finest gangster film\never shot. Made with finesse, style to spare and a director who elicits\npitch-perfect performances from a talented cast, this is movie-making\nas it should be.<br><br>Yes, it's a very long film and yes, some sections are quite slow.\nNevertheless, none of the film is any less than riveting. The story -\nof a father/son takeover in one of New York's major Italian Mafia\nfamilies - is fairly straight forward, and yet Francis Ford Coppola\nturns it into something else so much more; a meditation on the human\ncondition, perhaps.<br><br>Certainly this is a film that explores the darker side of humanity.\nJealousy, betrayal, anger and revenge are all key themes here, and the\nfilm is inevitably punctuated by moments of graphic and shocking\nviolence. And I'm glad Coppola chooses not to shy away from the said\nviolence, which makes it all the more gritty and realistic when it does\nhappen.<br><br>Marlon Brando takes the showrunner role here, the patriarch who's past\nhis prime, but it's easy to spot the real star of the piece: Al Pacino,\nwho burns up the screen with sheer ferocity. Robert Duvall is easy to\nmiss in a quieter part, but watch out for James Caan whose volatile\nSonny is one of the film's most engaging characters. Altogether this is\na splendid and unforgettable piece of film-making, which inevitably\nspawned sequels and a whole gamut of similar gangster fare, but THE\nGODFATHER towers head and shoulders above them all.\n"},
{"review": "\nPeople always say America is a big melting pot, but actually it is not\nactually like that. America is separated by different communities,the\nWASP, the catholics, Jewish people, the Asian, and the black\npeople.Italian immigrants belong to the catholics,but they are looked\ndown upon by some other European immigrants,so they have to ask help\nfrom their godfather, the mafia. This film is really impressive.Don\nColeone is really a good father, his elder son has a bad temper, his\nsecond son is weak, his younger son is intelligent ans unique.This is a\nbig family,this family culture is deeply rooted in their brains.This\nfilm is a mirror of Italy society:Power, Women and Money. There is a\nlot of media reports about Italy PM ex-PM Belusconi, why this corrupt\nPM not sacked even he faces lots of charges? People always say America\ndream, but the reality is cruel. If you want to make fortune, you must\nhave support from your relations even the mafia.The wealth is\ncontrolled by a few people, they make their money through their\nrelations become richer.This is Capitalism.\n"},
{"review": "\nDon Vito Corleone (Marlon Brando) is the head of a Mafia family. Sonny\n(James Caan) is his eldest and heir apparent. Michael (Al Pacino) is a\nreturn WWII hero and wants to keep out of the family business. The Don\nrefuses to go into the drug business which precipitate a mob war.<br><br>There is no doubt that this is one of the greatest movie of all times.\nDirector Francis Ford Coppola has crafted a masterpiece from Mario\nPuzo's novel. It is not just a great story, but great characters and\ngreat actors playing them. Forty years later, it's still as compelling\nas ever. The pacing is slower than today's standard, but it packs a\npunch more potent than anything recent. The acting power alone is\nincredible. When you consider that Al Pacino is the new unknown kid,\nthe cast is unquestionable the best that Hollywood has to offer in that\nera. Every 10 minutes, there is an iconic scene. There is no way I can\nlist them all.<br><br>I rarely give a 10. Rarer still do I give it with no reservation. A\nperfect movie is not enough. It has to have cultural significance and\nsome originality. That is 'The Godfather'. It is still being referenced\ntoday. May all the haters sleep with the fishes.\n"},
{"review": "\nThis movie was everything a good movie should be. I got The Godfather\nbox set last Christmas (I had already watched the series about 20 times\nby then) and I watched it honestly about 3 weeks straight after getting\nit. This movie however is hands-down my favorite of the series. The\nstory was amazing, and sure made Mafia life look like paradise. I loved\nthe characters, all of them, even the antagonists were unforgettable.\nEverything looked authentic 1940's style, there weren't any slip-ups as\nfar as I can tell. Marlon Brando, Al Pacino, James Caan, Robert Duvall,\nJohn Cazale all make a very authentic looking, and truly remarkable\nfamily. I was a huge Godfather encyclopedia for a while, I knew 95% of\nthe characters and everything, and its easy to see why, this is a very\nmemorable movie in every aspect. I loved this film at first sight. I\nread some of the \"Hated it\" comments, and they all say its boring or\nsomething. Those people need to grow up, if you want an action movie\nwatch Die Hard or something, this movie is a classic and if those\npeople lack the taste for good movies to watch it they need to take\ntheir hate of it elsewhere. This is a perfect movie and deserves a\n10/10. Watch this if you want a truly unforgettable experience.\n"},
{"review": "\nFor mafia members murders are nothing but business. They never kill for\npleasure. Only in case of need, cold revenge or even summary justice\n(punishment of traitors for instance). Besides this they all have\nnormal family lives with most cherished spouses and children and are\nusually very religious making pompous wedding, christening and funeral\nceremonies in the Church or under priests' directions. This reality and\natmosphere is splendidly shown in this movie that Coppola directed in a\nsuperb way and with a competent and strong hand. The cast has a\nstupendous performance. Marlon Brando plays a magnificent part in the\nrole of the old godfather of one of American powerful mafia families,\nmastering his intonation and facial expression effectively thus\ncreating an unforgettable character in the history of cinema. The\naction unfolds itself along the movie in a very captivating way. I want\nto stress particularly the sequence of the christening in which the new\nfamily godfather (Al Pacino) makes all the oaths in the name of the\nchild (of whom he is also the Catholic godfather) and before the priest\nwhile a parallel cut shows us all the time a series of murders of rival\nmafia chiefs that were taking place at same time in several other\nplaces and which had been ordered by himself. The contrast of the\nreligious scene and the violence of the killings is really impressive\nand full of meaning. This is maybe the best movie about mafia ever\nmade.\n"},
{"review": "\nAs \"great\" as the film is --- you can't help but realise how overrated\nand over-talked-about it really is. It's like it \"must be\" on every top\n3, 5, and/or 10 list of \"best films\" or \"all-time greatest films\" -\nwhen in all honesty, I don't think it should be. I actually prefer its\nsequel, The Godfather Part II. <br><br>The Godfather is a very good film - but I don't think it's as good as\nit's said to be. It has good acting, nonetheless, and outstanding\ndirecting. But after you've succumb to its somewhat impressive acting\nand directing, you'll realise it's merely a boring film with slow\nscenes that are difficult to draw you in. <br><br>People actually list this film as \"the greatest film ever made\" - Well,\nI can see it's an absolute classic with top-notch acting and\ndirecting... and that's it! It's no more. The second one is better -\nalthough it's merely the same (good acting, good directing, etc.) but I\njust think there are a few things that make Part II better.<br><br>Praise was looked towards Marlon Brando's influential, and extremely\ngrasping performance - and so it should. Pachino was great too, of\ncourse. There are many fantastic and inspiring things about the film -\nbut that being said, there are many other things I find boring, slow,\nand inpatient about it. However, it is a good film, overall. Just too\noverrated is all. <br><br>I would rate it 7.5 or 8.0 out of 10; whereas I would rate the second\none an higher rating of 9.5 out of 10. Maybe it's just each to their\nown, and it's everyone's own opinion. You like what you like. But it\nis, nonetheless, a remarkable achievement - I just wouldn't class it as\none of the greatest films ever. The second one, maybe, yes, but I\nprefer films such as The Dark Knight Trilogy, and the original Star\nWars films. <br><br>7.5/8.0 out of 10.\n"},
{"review": "\nThe first words in Francis Coppola's organized crime saga (\"I believe\nin America\") are spoken by a wronged father seeking justice from Mafia\nDon Vito Corleone, and with an immigrant's passion invoke the spirit of\nhis adapted homeland. It's an ironic gesture in a film which embraces\nthe American Dream with a vengeance, beginning with a joyful\ncelebration of marriage, ending with a solemn Catholic Church baptism,\nand continuing in between with murder after bloody murder: for\nvengeance; for punishment; or (with a severed horse head under the bed\nsheets) simply for leverage. The film gained notoriety for such epic\ndisplays of gangland violence, but its real power lies in nuance: a\nshading of phrase; a deceptive fall of lamplight; the sound of\nfootsteps on a hospital stairway. Credit goes to co-writers Coppola and\nMario Puzo for the leisurely paced but tightly plotted screenplay, by\nitself a remarkable study in contrasts, showing the thin line dividing\npatriotism and graft; honor and brutality; family affections and ritual\nviolence. Seeing Part One independent from its companion/sequel is like\nreading only the middle chapters of a long and complex historical\nnovel, rich in detail and drama, about an immigrant family coping with\nchanging times in the New World. The result is one of the few truly\neffective adaptations of a popular novel, and together with Part Two\nperhaps the last word in gangster film dramas.\n"},
{"review": "\nThe Godfather Trilogy was projected on one single day at the Paris\ncinematheque: 9 hours of film and 9 hours of pure delight!<br><br>I was motivated to see this trilogy in particular because it's one of\nmy first heart-struck in movies! I should thank my father for this,\nbecause as kids, we watched what he watched and it formatted me for\never: the music, the pride and honor of the family, their confidence\nfind a resonance in me, even though their heart are deeply corrupted by\nevil and they pay the price by the death of all dear ones! What's the\npoint of getting rich and powerful if it to live alone ? You can read\nmy review of the \"The Last Don\" for an in-depth analysis because the\nthematic background is the same\u0085<br><br>Brando is wonderful as an old Don and he looks like my late\ngrandfather. As we haven't time to spend time together, I am sure I\ntake Vito as an idealized root! <br><br>What caught my eyes in this first movie was that: - the story takes\nplace just after WWII (and not in 60 or 70) - it's Christmas time just\nas the projection - the dementia greed of Vito who wants a son to be\nPresident! - Their way of getting at the top: when they are denied\nhelp, they kill &amp; when they are asked for help, they exchange it for a\nfavor! It's far from streets tugs who ransom people!<br><br>So, as it is maybe the best movie ever made, you should see it and it's\nan offer you can't refuse!\n"},
{"review": "\nIt starts with a wedding. In this well-observed period set-piece\nthere's a nuclear microcosm of the Corleone business - the family -\ntheir relationships, characters and roles. The family is both the\nbackbone and burden of capo Vito Corleone's businesses, both licit and\nnefarious. They are support and affection in a world where betrayal and\nisolation are twin reapers, yet the sibling rivalry, disaffection and\nsimple disinterest are equal and ever present threats. The Godfather is\nthe story of the self-perpetuating tragedy of this dysfunctional bond\nof business and family; a grand study of ever-encroaching existential\nclaustrophobia out and inside the home, teamed with dramatic,\nreactionary Italian hot-headedness.<br><br>Coppola tells this story with operatic intensity and sweep, conjuring\ndramatic tension, indelible cinematic images and earnest melodrama. He\nhas one of the great casts - names that became - including Marlon\nBrando's greatest performance since his work for Elia Kazan in the\n1950s. Nino Rota's score is not only celebrated by association but is a\nperfect compliment to the film, at once stark, woeful and, on\nblossoming, radiant. 9.5/10\n"},
{"review": "\nThe Puzo novel is brought to the screen in the definitive tale of the\nMafia. A towering achievement for Coppola, who was only 32 when this\nfilm was released. Brando is ideally cast in the title role, but his is\nbasically a supporting role. This is the story of Michael, and Pacino\nis excellent in conveying the transformation of the character from a\ngeeky soldier to a tough mob boss. Caan, Duvall, and Castellano head\nthe terrific supporting cast. Despite the nearly three-hour running\ntime, it does not drag for a minute. The cinematography perfectly\nevokes the period. Rota's score is one of the most memorable in film\nhistory.\n"},
{"review": "\nThe Godfather (1972, Dir. Francis Ford Coppola) <br><br>Don Vito Corleone (Brando) is the head of an organised dynasty, who has\nan expanded family, which he loves truly. But when Don Vito is shot and\nends up in hospital, control of the family business is given to his\nson, Michael (Pacino), who must go into hiding for the protection of\nhimself and his father.<br><br>Cinematic classic which can't go wrong. Marlon Brando has been\nperfectly cast in the role which gains every emotion from him. Along\nwith Pacino and the rest of the supporting cast, the Godfather keeps\nyou hooked in for the entire length of its running time.<br><br>He came all the way from California. I told you he'd come! - Don Vito\nCorleone (Marlon Brando)\n"},
{"review": "\nI am not saying anything new when I say that this is the best movie in\nthe history of cinema (at least for most of the people). \"The\ngodfather\" is a major film with a great plot, great performances and it\nis entertaining since its first moment until the last second. Most of\nus who have watched it know at least almost of memory some little\nphrase told by any of its characters.<br><br>I am not a big fan of Marlon Brando (even thought I found him\nextraordinary in \"A Streetcar Named Desire (1951)\") but I recognize\nthat he made the role of \"vito corleone\" one of the 5 most important\ncharacters in the history of cinema, nobody could have made this\ncharacter better than him. Al Pacino became famous thanks to his\nperformance as Michael Corleone in this film, where we can see his\ntransformation from a nice guy to a cold mafia boss.<br><br>I have watched this film like 10 times and each new time I watch it I\nlike it more.<br><br>The best movie ever\n"},
{"review": "\nThe Godfather is simply put a masterpiece. I would highly recommend it\nto anyone who hasn't had the chance to enjoy Coppola's best movie.\nFirst off, the actor's performances are top notch. Al-Gore especially\ndoes an amazing job as Michael, always wearing a serious face, really\nbecoming a very professional gangster. The other actors also contribute\nimmensely to the film but none stand out quite like Robert Duvall,\nBesides Al-Gore. From humble beginnings as Bo Riddley, Duvall really\nhas come a far way as he plays the character of Tom Hagen, Lawyer of\nthe mob. Next there's the shots. Almost all shots have a purpose, from\nthe beginning shot over the godfather's shoulder to slowly approaching\na man sleeping with his horse's head. Similar to how shots serve a\npurpose to the movies progression, so do props. An iconic prop from the\ngodfather are the oranges. Coppola places oranges in scenes to\nforeshadow that something bad is about to happen, like when the\ngodfather gets shot he's buying oranges! The sound track was also very\nwell done. The violins really give a mobby feel and how the music built\nup during certain scenes really helped build up tension.(Spoilers) My\nfavorite parts of the movie were when they hit the driver near the\nstatue of liberty, when Michael kills the opposing mob boss and cop,\nThe final scene when Michael closes the door on his girlfriend, and\nfinally, my favorite, the epic finale where each mob boss is killed of\none by one as Michael becomes a literal godfather to his sister's child\nand the godfather of the mob. Overall, I really enjoyed the Godfather\nfor doing everything right, 10 out of 10\n"},
{"review": "\nThe Godfather (including Part 2 for purpose of this review) is probably\nthe most analysed film of all time, so really I don't see the point in\nrepeating any of the rhetorics. Rather, what I intend to provide here\nis my honest two cents of this film.<br><br>The Godfather is not an easy film to watch, so it baffled me at that\ntime of watching for the first time (and still baffles me to this day)\nhow it is so universally loved by almost anyone who has watched it.\nFirstly, there are so many characters that I gave up remembering anyone\nother than the Corleone family. Secondly, the script is so subtle and\ntight that the moment I missed a single sentence, I did not get the\nnext scene. It was no easy feat to follow every sentence given the\nfrequent mutterings, so subtitles are almost indispensable. In the end,\nI pretty much referred to the plot synopsis every 5 minutes.<br><br>Make no mistake, the reasons above are also what probably makes the\nGodfather regarded as one of the greatest films of all time. It just\nsurprises me how a film as subtle as the Godfather has received just as\nmuch attention as 'lighter' classics such as Star Wars, Pulp Fiction,\nTaxi Driver, Goodfellas, etc.<br><br>Ultimately, my verdict is that the Godfather is a great, iconic film\nfrom the 70s era, but my honest take is that the Godfather is perhaps a\nlittle over-hyped (not overrated, but over-hyped) to the extent that it\ngets more exposure than some of the other equally great films from the\nolden era. For that, the Godfather is a great film, but is not in my\nconsideration for the greatest film of all time.\n"},
{"review": "\nI was expected a lot from this movie as it is ranked in the second\nplace of IMDb top movies. I know that my opinion is oppose to the\nmajority but here is my opinion. The Godfather movie is quite boring\nfor me. The actions and everything are quite slow and in monotone. The\nshooting scene in the movie was radiculous and not realistic. The\nshooting is quite bad as it is an old movie which I understand. The\nstory line is quite simple and quite straight. As I watched this movie,\nI forced myself to not fall asleep. The only good thing from this movie\nis the acting and also the music was on point. I would not recommend\nthis movie for those who don't like slow pace movie or even a classic\nmovie.\n"},
{"review": "\nThe Godfather is a 1972 American crime film directed by Francis Ford\nCoppola and produced by Albert S. Ruddy, based on Mario Puzo's\nbest-selling novel of the same name. It stars Marlon Brando and Al\nPacino as the leaders of a fictional New York crime family. The story,\nspanning 1945 to 1955, chronicles the family under the patriarch Vito\nCorleone, focusing on the transformation of Michael Corleone (Pacino)\nfrom reluctant family outsider to ruthless Mafia boss.<br><br>Paramount Pictures obtained the rights to the novel before it gained\npopularity for the price of $80,000. Studio executives had trouble\nfinding a director, as their first few candidates turned down the\nposition. They and Coppola disagreed over who would play several\ncharacters, in particular Vito and Michael. Filming was done on\nlocation and completed earlier than scheduled. The musical score was\ncomposed primarily by Nino Rota with additional pieces by Carmine\nCoppola.<br><br>The film was the highest-grossing film of 1972 and was for a time the\nhighest-grossing film ever made. It won the Oscars for Best Picture,\nBest Actor (Brando) and Best Adapted Screenplay (for Puzo and Coppola).\nIts seven other Oscar nominations included Pacino, James Caan, and\nRobert Duvall for Best Supporting Actor and Coppola for Best Director.\nIt was followed by sequels The Godfather Part II (1974) and Part III\n(1990).<br><br>The Godfather is widely regarded as one of the greatest films in world\ncinema and one of the most influential, especially in the gangster\ngenre. It was selected for preservation in the United States National\nFilm Registry in 1990 and is ranked the second-greatest film in\nAmerican cinema (behind Citizen Kane) by the American Film Institute.\n"},
{"review": "\nWhat can be said about this movie that hasn't already been said?\nIconic. Legendary. Great. Historical. Certainly it's this and more. The\nGodfather isn't just a film about one Sicilian immigrant's rise to\npower,respect and wealth in America as head of an organized crime\nfamily,it's an epic journey about a man,his family and the inner\nworkings of the Mafia. Stellar and outstanding performances from the\nentire cast and excellent direction from Francis Ford Coppola make this\nfilm a must see for any film buff. If you see it,you won't be\ndisappointed. If you miss it,you'll be doing yourself an injustice. And\nnext to Clint Eastwood's Dirty Harry Callahan's \" Make my day \", Marlon\nBrando uttering the immortal line \"I'll make you an offer you can't\nrefuse\" is just cinematic gold.\n"},
{"review": "\nThe godfather trilogy is an exclusive set of movies that will continue\nto live with humanity, every generation will see them to say, \"Oh that\nwas 10 out of 10.\" If you watch them you will know that the world that\nlives inside the underworld is same as the one we live in except that\npeople in underworld are so smart, in fact smartness is the only thing\nthat can keep them there. Don Vito Caroleone's early life shown in\npart-II is very well done to show the Don in making, how a kid who\ncouldn't even tell his name went on becoming a underworld don who keep\nmost senators, judges and lawyers in his pocket. Meeting of don with\nthe so call five families are among most impressive scenes.<br><br>A saga that goes on for 9 continuous hours takes you around various\nwalks in life of Mike (Don's younger son who become Don later), his\nschool days, love life, personal life, family life, business life,\npolitical life and religious life. How all of these different roles\nMike plays in his life and how intertwined these are.<br><br>I enjoyed watching these movies so much, I wish I had seen them much\nbefore then I did. Its amazing to see how the Part-III was made 18\nyears later the part-I was made and everything looks so continuous if\nwatch them together.<br><br>I need not say much! The Godfather father trilogy been around for a\nwhile and everyone knows that they are great set of movies, its just\nthe matter of when you actually get to see them.<br><br>Watch them! Kudos to Francis Ford Coppola! -Vishy\n"},
{"review": "\nYeah. I don't think i have to write more than that actually. I think\nthe most of you already know how good this movie is (or how good these\nmovies are), and what the story is. <br><br>It has so much emotion and is depicting that world so compelling, it's\nhard to explain it without spoilers. <br><br>If you like crime movies, watch it. If you like drama, watch it. Do you\nlike suspense and action? Watch it. Do you like music? Watch it. <br><br>It's the kind of movie that has everything. The kind of movie that\nleaves you breathless, that you will never forget. <br><br>The only people who shouldn't watch it is the ones that only like\nmodern movies with lots of cgi and big explosions and action from start\nto finish.\n"},
{"review": "\nFirst of all, it's been a while since I decided to watch The Godfather,\nbut somehow I never have enough will power to do so. I heard people\nsaying it's the greatest movie of all time, but I was still being\nskeptic about this statement, as I couldn't imagine a movie with such a\nlong play time grabbing your attention all over it. When it started\nplaying I could sense the outstanding feeling of the early 50's USA. It\njust felt natural to be part of this world, as we were born to it. The\nplot is not to be detailed, as it's one of the most famous movies, but\nI can assure everyone, this is the strongest part of the film. Of\ncourse there are some action scenes where bad people shoot with guns,\nthere are some romantic scenes where beautiful woman make love with\nhandsome man, but all of these give the essential of the Godfather. We\nlearn the rules of this world, without directly being told each of\nthem. We become the part of the family, and we suffer or win, as the\nCorleones do. We start to worry about the characters, that feel alive\nand realistic. Our first, probably negative impression are getting\noverwrite by the deeper, and more considered emotions, which are more\nlikely to be positive. We understand that some things have to be done,\nno matter what the moral says. Yes, we can live the live of the\nCorleones, and that's a thing not every movie can provide. The\nGodfather is not the best movie of all time, not for me at least. But\nit surely worth watching, not just because it's a legend, but for why\nit has become a legend.\n"},
{"review": "\nAfter so many years of only knowing of this movie by reputation, I\nfinally watched this in its entirety on a flight from Korean Air. It's\nsuch a violent movie and I was very surprised it was even shown on the\nplane though there was a disclaimer that anyone younger than 18 should\nonly watch with an adult guardian. What did I think of the film,\nitself? Well, it's fascinating to watch all the scenes leading to\ncertain killings and the male cast members certainly put their heart\ninto the roles though the female cast members don't have as much of a\nchance to develop their characters as fully as their opposites. But\nknowing both Diane Keaton and Talia Shire have parts in the two sequels\nmakes me think I'd get the know their characters better later on. I\nalso read on Wikipedia of deleted scenes restored when the three films\nin the series were put together for TV and DVD/VHS so maybe that may\nalso be an offer I couldn't refuse to watch someday. In summary, The\nGodfather was a very good film though I stop at considering it one of\nthe greatest of all time...P.S. I was familiar with singer Al Martino\nway before his role in this film as my parents owned three of his\nrecord albums-This is Love, Spanish Eyes, and A Merry Christmas-that I\nused to listen quite frequently to as a kid during the '70s.\n"},
{"review": "\nThis film is one of the best! The acting and the chemistry between them\nare amazing. In this film Tony Montana is Micheal Corleone, born as the\nlast child of Don Vito Corleone, played by Marlon Brando, the head of\nthe Corleone family (Spoilers!: You see more of Vito's background in\nthe second movie) , a big family in New York. But Micheal isn't like\nTony, but though the movie he does some crimes for himself. The\nsoundtrack blends really well with the sounds of the movie, you hear it\nbut it isn't too loud, nor it's too low. Marlon and Al really make this\nmovie. If you haven't seen it already, well buy it on Blue ray or watch\nit on Netflix. It gets only better when you seen all the trilogy.\n"},
{"review": "\nI'll start off by saying, as the title says that this is most certainly\none of the best movies I ever watched. The movie is fun to watch,\nwhat's most important and it's not just for certain parts of the movie,\nbut the whole movie all the way through from the beginning to the end\nis interesting and unpredictable. This is something that today's movies\nlack, and what the movies from the past always had which made them\ngreat. Story of the movie if fascinating allowing us to see what the\nreal \"mobster world\", underground world to be precise looked in the\n1960's, 1970's as many scenes in the movie show us. All in all this is\none hell of a movie and I'd suggested to everyone to watch.\n"},
{"review": "\nI have dissected this film, piece by piece. This is a film that can be\nseen several times, and each time, you take something else from the\nfilm. It's incredibly difficult to digest all of the beautiful layers\nthat make The Godfather so special. There are thousands of films out\nthere that are cut-n-dry. Basically, what u see is what u get....no\nless, no more. While, if u don't have an understanding of organized\ncrime and its origin, u will most likely overlook the remarkable\naccuracy of the film. The life that is portrayed in The Godfather was\nvery real, for many many years. However, as yrs went by, organized\ncrime families, in America, began slowly straying from their core\nvalues...i.e., family, \"Omerta\" (code of silence), secrecy, respect,\nloyalty, etc. The Godfather illustrates life in the mafia during the\n1st half of the 20th Century, where as a film like Goodfellas, shows\nmafia life during the 2nd half of the 20th Century. The Godfather is a\nfilm loaded w legendary actors who perform a script that's full of\nsubstance &amp; grace, both, written &amp; directed, by the great Francis Ford\nCoppola. Movies like, The Godfather, come around only a handful of\ntimes during a lifetime. Cinematic masterpiece.\n"},
{"review": "\nWhat can I say about The Godfather that hasn't already been said? The\n1972 film is widely regarded as the best film of all time. Everybody\nhas heard of it and even if they haven't seen it, they can instantly\nrecognize it. <br><br>Although the way that nobody in The Godfather swears like a real\ngangster does bother me quite a bit, this is still one of the best\nmafia movies in the world and definitely the best fiction crime film. <br><br>The story views the Mafia from the inside. That is its secret, its\ncharm, its spell; in a way, it has shaped the public perception of the\nMafia ever since. The real world is replaced by an authoritarian\npatriarchy where power and justice flow from the Godfather, and the\nonly villains are traitors. There is one commandment, spoken by Michael\n(Al Pacino): \"Don't ever take sides against the family.<br><br>From the opening of The Godfather we know right away who Vito Corleone\nis. We know what kind of man he is and we know what he stands for.\nDespite being a gangster, the audience always thinks of him as a good\nman. He does not let any harm come to anyone who is not in \"the\nbusiness\". He does not like to use violence unless it is really needed\nand says time and time again that family always comes first. And the\nway Marlon Brando's amazing performance portrays this is nothing but\nexceptional.<br><br>Al Pacino's role as Michael Corleone was perfectly cast and launched Al\nPacino's career and made him the man that we all know today.<br><br>The Godfather has terrific energy, you get sucked into the world of The\nGodfather and you are a part of what is going on and that is what makes\nthe viewing experience of The Godfather so amazing.\n"},
{"review": "\nFrancis Ford Coppola manages to execute one of the finest pieces of\nAmerican cinema with the first of his three part saga, The Godfather. <br><br>From the dialogue to the acting, this film excels in painting a gritty,\nrealistic depiction of the mobster hierarchy, with one of the greatest\npieces of acting in cinematic history with Marlon Brando's Don Vito\nCorleone. <br><br>This film has already stood the test of time and is deservedly ranked\nas one of the greatest films of all time. A true masterpiece.<br><br>I urge you if you have not yet checked out this film, what are you\nwaiting for? It's a true hallmark of cinematic excellence and is\nundoubtedly one of the greatest films ever made, in my opinion.\n"},
{"review": "\nEveryone at some point will see \"The Godfather\" unless they live under\na rock. This classic beginning of an epic trilogy beholds a crime story\nunlike any other for one reason: it doesn't view the crimes as crimes.\nFrancis Ford Coppola shows the business end behind the Italian mafia\nafter WW II. Don Corleone (Marlon Brando) passes his organized crime\ndynasty to to his reluctant son Michael (Al Pacino) after tensions rise\nbetween his fellow Mafia families. This epic reflects a struggle\nbetween a family caught up in crime and portrays the consequences that\nerupt due to such activity. Coppola engages audiences with the settings\nhe portrays with wonderful music and camera work that helps tension\nrise and lets viewers experience the characters' emotions. Unlike many\nother films made in the seventies, \"The Godfather\" gets its production\nvalue right. It has fantastic costumes and sets that allow you to\nengage in the characters' conflicts. But what this film does best is\nshow the devastation of a family enlisted in a horrible business that\ncan prove fatal. It makes you rethink everything you know about mafia\nand show a humanized version of real people who, due to their family,\nend up doing bad things. This isn't a film about bad people. It's a\nfilm about people doing bad things, all in the name of business.\n"},
{"review": "\nThis is by far the best movie ever to give a portrait organized crime,\nthis movie goes deep inside and shows it all inside out..<br><br>With superb acting by especially Al Pacino as Mike Corleone and Marlon\nBrando as Don Vito corleone this movie shows how one of the head mafia\nfamilies in New York works, it gives a detailed picture of how their\nbusiness runs and what kinda chances they got to take on their\nbusiness, for example their denial to step inside the narcotic business\nbrings on a lot of troubles, but also it shows what kinda sacrifices\nthey make, every day could be their last day..<br><br>Al Pacino shines above all in this movie, as the smart boy of the\nfamily he returns after fighting a war for his country, at that time\nnot involved in the family business, but it doesn't take long before\nthe war breaks lose and he see no other ways than to step in and fight\nfor his family.<br><br>This is definitely a \"must see\" masterpiece.\n"},
{"review": "\nOne of the best classics of all time, good story, with incredible\nacting. Even though the movie was three hours long, it's hard not\nfinish it.The sequence of the movie flows so good in a way, the\naudience are always wondering what's going to happen next. Very\nenjoyable, even for people who don't like Mafia movies in general,\nbecause the movie discusses many things in life like family, greed,\nloyalty and relationships.<br><br>It's a really great combination that makes the movie one of the best\nmovies of all time, and it always be enjoyable for future generations\nas well.\n"},
{"review": "\nThis is by far the best movie ever to give a portrait organized crime,\nthis movie goes deep inside and shows it all inside out..<br><br>With superb acting by especially Al Pacino as Mike Corleone and Marlon\nBrando as Don Vito corleone this movie shows how one of the head mafia\nfamilies in New York works, it gives a detailed picture of how their\nbusiness runs and what kinda chances they got to take on their\nbusiness, for example their denial to step inside the narcotic business\nbrings on a lot of troubles, but also it shows what kinda sacrifices\nthey make, every day could be their last day..<br><br>Al Pacino shines above all in this movie, as the smart boy of the\nfamily he returns after fighting a war for his country, at that time\nnot involved in the family business, but it doesn't take long before\nthe war breaks lose and he see no other ways than to step in and fight\nfor his family.<br><br>This is definitely a \"must see\" masterpiece.\n"},
{"review": "\nIt is sort of disheartening to read the plethora of negative reviews of\nthis film on IMDb. There seems to be a fundamental gap between those\nwho understand and appreciate the history and the evolution of cinema\nand those whose powers of perception and attention spans have been\nimpaired by mind-numbing video games and by a culture of total\nimmersion in the utter banality of \"social media.\" I even read one\nnegative review which seriously attempted to draw a comparison between\n\"The Godfather\" and the \"Lord of the Rings\" trilogy. I loved both\nmovies by the way, but FOR CHRISSAKES! It's apples and oranges! One of\nthose movies was a thoughtful, introspective ADULT film, which are few\nand far between. The other film, though great entertainment, was not.<br><br>The acting (across the board), the script (almost entirely Coppola's)\nand directing (entirely Coppola's) in the \"The Godfather,\" though\narguably equaled on occasion, have never been bested by any Hollywood\nor independent film. One qualification here: to the amazement of every\nfilm critic and everyone else alive in the 20th Century, the movie \"The\nGodfather\" was actually eclipsed by \"The Godfather, Part II,\" which\nreally needs to be seen back-to-back with \"The Godfather\" in order to\nfully appreciate either film. The two films in combination are really\njust the 1st and 2nd halves of Mario Puzo's pulp fiction book, entitled\n\"The Godfather.\" Coppola's screenplay elevated Puzo's 2nd-rate prose\nimmeasurably, and together those two films constitute the single\ngreatest piece of epic-scale movie-making in the history of American\ncinema.\n"},
{"review": "\nThis is by far the best movie ever to give a portrait organized crime,\nthis movie goes deep inside and shows it all inside out..<br><br>With superb acting by especially Al Pacino as Mike Corleone and Marlon\nBrando as Don Vito corleone this movie shows how one of the head mafia\nfamilies in New York works, it gives a detailed picture of how their\nbusiness runs and what kinda chances they got to take on their\nbusiness, for example their denial to step inside the narcotic business\nbrings on a lot of troubles, but also it shows what kinda sacrifices\nthey make, every day could be their last day..<br><br>Al Pacino shines above all in this movie, as the smart boy of the\nfamily he returns after fighting a war for his country, at that time\nnot involved in the family business, but it doesn't take long before\nthe war breaks lose and he see no other ways than to step in and fight\nfor his family.<br><br>This is definitely a \"must see\" masterpiece.\n"},
{"review": "\nIn order to grasp the true depth of this movie - you have to read the\nnovel. It's mandatory. To understand the Corleone s, the era in which\nthey flourished &amp; the times in which Vito made Don !!<br><br>Vito Corleone played by Marlon Brando is the greatest portrayal of a\nfictional character on screen. No one could have played him better.<br><br>The adapted screenplay is optimally redesigned to keep the movie fast\npaced, gripping &amp; electric with the fair share of thrills.<br><br>In one scene, outside the hospital waiting for men, Michael examines\nhis hand. It isn't shaking in spite of the fear. As in the novel, he is\nbeginning to realize, he has a unique calm about him in times of grave\ndanger.<br><br>That is a magnificent scene, one only Coppola could have directed.<br><br>I can go on and on and on .. each scene is a monument of artistry. <br><br>Watch this movie before you die !!!<br><br>PS: Read the novel first ....\n"},
{"review": "\nThe Godfather is an absolute \"Classic\". Both Al Pacino and Robert\nDeNero killed their roles. It's not often we get a movie with such\nin-depth detail as to why things happened the way they did. Politically\ncorrect in every \"bad\" way. I was very young when i first seen this\nmovie and really didn't grasp the exact concept. Now, as an adult, it\nall makes sense. If anyone reading this has never seen this movie, I\nrecommend you watch it and the others as well. It might even touch home\nwith most that grew up in these neighborhoods and countries during the\ndate allocated within the film. Film makers and anyone acting should\nmake it an occupation to watch this film. Exciting, passionate,\ndramatic. These are the words I use to best describe my experience with\nwatching this movie. It has also sparked my interest in making my own\nfilms. The action and originality of the film makes me want to create a\nmovie just like this one in modern day times. Thank you Godfather, for\nyou have given me much needed inspiration.\n"},
{"review": "\nSo this movie is only number two out of 250 of the greatest movies ever\nmade \u0096 whatsa-matta wid u? Dis movie should be numba one; along wid\n\"Goodfellas\" and \"Casino.\" Yeah \u0096 dats right, dey all gotta be numba\nones; numba twos is for losers. Time to make offers dey can't refuse;\nclean da horse-heads out a-da bed and load up dat ole John J. Bartek\nmoving van \u0096 we gotta settle dis \u0096 once and for all. OK, maybe I am\ngoing a little over the top, but before the Corleone family hit the\ncinemas, there really wasn't much spattering screens that defined what\nwent on behind closed doors in 'The Cosa Nostra'; 'The Mafia'; 'The\nFamily' or whatever these folks are known as. From the time Mario\nPuzo's pen first bled ink onto an empty pages, who would have guessed a\nmasterpiece was about to be born. By the time Coppola's finishing\ntouches on this creation, there could hardly be any doubt. This\ncinematographic brilliance known as, 'The Godfather' is a story hard to\nbeat. There are those who say the movie is 'overrated'...to them...I\nsay 'Go Watch \"The Birdman.\"' Haters are just going to hate like a\nbunch of crybaby haters. \"The Godfather's\", writing and script are\nsuperb; the acting and cast is outstanding and the saga's story-line is\nunmatched, what else is needed? I like the pace and depth. No super\nvillains and no super cops...just Mob vs. Mob vs. Mob...I love it.\nAnyways \u0096 watch this when you can - or if you haven't already. You are\nencouraged to come to your own conclusion using sound judgment. And\nremember...if you don't mark this as numba one you will want to\nreconsider \u0096 at least that's if you know what's good for you.\n"},
{"review": "\nHailed as the best movie ever by most people, and I tend to agree. We\nprobably won't see a movie this perfect in quite some time. Everything\nfrom the casting to the execution of the finished film is handled with\nsuch precision it is truly astounding.<br><br>I guess you are wonder why I wrote \"probably\" in the summary and well,\nlet me tell you this: There is another movie that is if not better at\nleast on the same level as this one. And the movies name? It ends with\nII.<br><br>That Francis Ford Coppola was capable to pull this of at such a young\nage is awe inspiring and even more so when he did it a second time\naround. I mean how many movies have a sequel/prequel that is if not as\ngood even better than the first one? Don't worry, you can count I will\nbe right here waiting for you to finish. What did you find? Terminator\n2, Lord of the rings 3, Toy Story 3, The Bourne trilogy and The Dark\nKnight? Well you would be correct and this shows you have rare it is\nwhen you think about how many sequels there are.\n"},
{"review": "\nWidely regarded as one of the greatest films of all time, this mob\ndrama, based on Mario Puzo's novel of the same name, focuses on the\npowerful Italian-American crime family of Don Vito Corleone (Marlon\nBrando). When the don's youngest son, Michael (Al Pacino), reluctantly\njoins the Mafia, he becomes involved in the inevitable cycle of\nviolence and betrayal. Although Michael tries to maintain a normal\nrelationship with his wife, Kay (Diane Keaton), he is drawn deeper into\nthe family business.<br><br>The Godfather, which opened at five theaters here yesterday, is a\nsuperb Hollywood movie that was photographed mostly in New York (with\nlocations in Las Vegas, Sicily, and Hollywood). It's the gangster\nmelodrama come of age, truly sorrowful and truly exciting, without the\nfalse piety of the films that flourished forty years ago, scaring the\ndelighted hell out of us while cautioning that crime doesn't (or, at\nleast, shouldn't) pay.<br><br>It still doesn't, but the punishments suffered by the members of the\nCorleone Family aren't limited to sudden ambushes on street corners or\nto the more elaborately choreographed assassinations on thruways. They\nalso include lifelong sentences of ostracism in terrible, bourgeois\nconfinement, of money and power, but of not much more glory than can be\nobtained by the ability to purchase expensive bedroom suites, the kind\nthat include everything from the rug on the floor to the pictures on\nthe wall with, perhaps, a horrible satin bedspread thrown in.\n"},
{"review": "\namazing movie The Godfather is a 1972 American crime drama film\ndirected by Francis Ford Coppola and produced by Albert S. Ruddy from a\nscreenplay by Mario Puzo and Coppola. Starring Marlon Brando and Al\nPacino as the leaders of the fictional Corleone New York crime family,\nthe story spans the years 1945\u009655, concentrating on the transformation\nof Michael Corleone from reluctant family outsider to ruthless Mafia\nboss while chronicling the family under the patriarch Vito Based on\nPuzo's best-selling novel of the same name, The Godfather is widely\nregarded as one of the greatest films in world cinema[6]\u0097 and as one of\nthe most influential, especially in the gangster genre.[7] The film\nranks #1 on Empire magazine's 2008 list of the 500 greatest movies of\nall time.[8] Ranked second to Citizen Kane by the American Film\nInstitute in 2007,[9] it was selected for preservation in the United\nStates National Film Registry of the Library of Congress in 1990 as\nbeing \"culturally, historically, or aesthetically significant\".<br><br>The film was the box office leader for 1972 and for a time, was the\nhighest-grossing picture ever made. It won three Academy Awards for\nthat year: Best Picture, Best Actor (Brando) and in the category Best\nAdapted Screenplay for Puzo and Coppola. Its nominations in seven other\ncategories included Pacino, James Caan and Robert Duvall for Best\nSupporting Actor and Coppola for Best Director. The success spawned two\nsequels: The Godfather Part II in 1974, and The Godfather Part III in\n1990.\n"},
{"review": "\nIn 1968 I met the great man Marlon Brando with Charles Chaplin after\nthe completion of 'A Countess from Hong Kong'.We all had lunch\ntogether. During our meeting I gave him a piece of amber on a leather\nstring which I was wearing and he had admired and commented 'You are\nwearing the mystical stone ,20 million years in the creation'. He\ntucked it into his shirt. I have always wondered particularly as I\nwatched Marlon in 'The Godfather' if he kept his promise always to wear\nit. I was told years later that he did ..but I have no way of knowing.\nMaybe someone out there knows.I was meeting the two great men in my\ncapacity as an art dealer and they commissioned from one of my artists\na portrait of Sophia Lauren in bronze..At 83 I am writing my memoirs to\nbe titled 'SENTENCED TO LIFE'.Sir Charles and I spoke of the\nsimilarities of our beginnings..He in a Home for Waifs and Strays ...Me\ntoo...His mother confined in a lunatic asylum ..My mother too.'The\nColney Hatch Insane Asylum ' in North London ..He then stated 'Remember\n! From the moment we are born. We are sentenced to life'.As I wrote my\nmemoirs 50 years later it seemed to be a perfect title ..\n"},
{"review": "\nWhile some may claim showing the scenes in reverse is just an annoying\ntrick to make a simple plot confusing and add a plethora of twists, I\nwholeheartedly disagree. Any good story teller knows it's not what you\nsay, but how you say it.<br><br>By playing the scenes in reverse you experience the confusion Lenny\nundergoes throughout the film. Showing some of the scenes in\nchronological order (BTW, the use of B&amp;W instead of color to make the\ntime distinction was ingenious) creates suspense which builds as the\ntwo time lines converge. The somewhat rushed pace (compared to a\nwritten format) doesn't give you enough time to adequately analyze the\nevents during the movie. This has two advantages: firstly you're going\nto talk about it after you leave the theater adding to experience\nimmensely, and secondly you don't have time to think about what has\nhappened (will happen) so you're experience better follows that of\nLenny.\n"},
{"review": "\nThe Godfather is a timeless classic. Everything about it is just\nmasterful from the performances to the direction to the wonderful\nsoundtrack. Marlon Brando effortlessly portrayed the cool calm\ncomposure of Vito Corleone, whilst Al Pacino was great as Michael\nCorleone. His transformation from family outsider to ruthless mob boss\nwas believable and realistic. The Godfather also felt authentic from\nthe sets to the costumes. One thing that also surprised me was how\ndespite the Godfather being a three hour film, it is paced very well. I\nnever felt confused or bored whilst watching it. It is an amazing film.<br><br>Read my full review here: http://goo.gl/ToQuF3\n"},
{"review": "\nIf you think again, you will realize that writing a review about The\nGodfather is quite stupid! This is a movie, every person in this world\nshould have seen before death! I cannot understand people who do not\nlike this movie!<br><br>It is suspenseful, partly shocking, political, love story and much\nmore... Simply the best movie of all time<br><br>If there is someone who reads this review and hasn't watched The\nGodfather... WATCH THIS ONE and you will agree that there is no movie\nthat is better! Believe me! Watch The Godfather!<br><br>NOW!!!\n"},
{"review": "\nThe Godfather is one of the rare movie which makes us sympathize the\nevil. Don Vito Corleone (Marlon Brando) gives out the steam of a real\nmafia Don. The story views the Mafia from the inside. That is its\nsecret, its charm, its spell; in a way, it has shaped the public\nperception of the Mafia ever since. The real world is replaced by an\nauthoritarian patriarchy where power and justice flow from the\nGodfather, and the only villains are traitors. There is one\ncommandment, spoken by Michael (Al Pacino): \"Don't ever take sides\nagainst the family.\" Like Babe Ruth is to baseball, like John Steinbeck\nis to writing, their is no doubt about it, The Godfather is the\ngreatest film of all time. Never before have we seen performances so\nstellar, by Marlon Brando, Al Pacino, James Caan, Robert Duvall, and\neveryone else! The Godfather has little life lessons everywhere. Along\nwith an engaging plot, that just completes the most critically\nacclaimed film of all time. The Godfather is Francis Ford Coppola's\nmasterpiece.\n"},
{"review": "\nStrong story ... professional actors .... Directed by smart ...\nEverything was in its peak...No matter how I look at this film is still\nattractive...He gives lessons on life and politics.....Although the\nfilm is old but it was attractive and new and never be out of\ndate....While the film is long but not boring any moment of the film\nup...About coming to power, says. About a poor family that is\npowerful....About sacrificing the values to achieve the target on the\nfirst letter of his power....Strong story ... professional actors ....\nDirected by smart ... Everything was in its peak...No matter how I look\nat this film is still attractive...He gives lessons on life and\npolitics.....Although the film is old but it was attractive and new and\nnever be out of date....While the film is long but not boring any\nmoment of the film up...About coming to power, says. About a poor\nfamily that is powerful....About sacrificing the values to achieve the\ntarget on the first letter of his power....\n"},
{"review": "\n\"The Godfather\" is flawless, and one of the greatest films ever made.\nThe Godfather is one of the very few films that doesn't have a single\nflaw. Seeing The Godfather for the first time was the most amazing\nmovie experiences of my life. There's scenes that stay with you when\nthe movies over, and you don't forget them. Everyone makes the mistake\nof calling this film a movie about crime. Its really a movie about\nfamily. The dialogue is just unbelievable. I've seen the movie at least\n30, 40 times, and I'm still amazed at how perfect it is. The music, the\nacting, everything. This is the best role Al Pacino ever played, and he\ndidn't win best actor. The only negative thing i could say i have\nagainst the film. Marlon Brando is Don Vito Corleone, head of perhaps\nthe most powerful New York-area mafia family in the 1940's, in this\nwell- respected film by director/writer Francis Ford Coppola. As the\nfilm begins, Vito is receiving \"business\" guests in his office at his\nhome while his daughter Connie's (Talia Shire) wedding and reception\nare taking place. The epic plot takes place over many years, telling\nthe story of Vito, his family--including Michael (Al Pacino), Santino\n(James Caan) and Tom Hagen (Robert Duvall), his associates, and their\ninteractions with other mob syndicates.\n"},
{"review": "\nMarlon Brando's old flame that has glowed for years, and flickered\nalong a trail bumpy with mediocre pictures, shines higher and brighter\nthan ever. The old irresistible magic is revived in Paramount's \"The\nGodfather\" in his intuitive grasp of Mario Puzo's Don Corleone, a\nliving symbol of the poetic translation of his name, the lionhearted.<br><br>Brando is cool as the godfather, sagacious head of the Corleone\n\"family,\" most powerful of the five \"families\" of organized crime in\nNew York. He is relaxed as the loving, indulgent patriarch of his large\nblood family, in his mansion behind an iron fence in Long Beach, L.I.\nAnd he is terrifically appealing as the man who cheats death, recovers\nfrom bullet wounds inflicted by a rival gang, recuperates at home to\nenjoy his garden and grandchildren until he dies of old age. Once he\ncomes out of seclusion, to warn chiefs of the five \"families\" that the\ngang war must stop.<br><br>Brando is the strong magnet that will draw fans to \"The Godfather.\" But\nbehind-the-scenes creativity is of equal value to this film of towering\nproportions.<br><br>The immensity of the project must have been staggering, but producer\nAlbert S. Ruddy, director Francis Ford Coppola and screenwriter Mario\nPuzo, with Coppola, make it seem easy.\n"},
{"review": "\nGlorious film in a glorious trilogy. Couldn't leave my bed to get a\ndrink whilst watching this masterpiece which was a shame because I got\nrather parched. It was pleasant watching Mike turn from a War Hero to a\ncold-blooded gangster-murdering wife-beating badass. Unfortunately his\nbrother Sunshine wasn't as lucky and received quite an excessive amount\nof metal shot at him but he was a bit of a dick so I was fine with that\nand it looked cool, good way to go imo. Tom Hagen (Robert Duvall)\nseemed like a good bloke but changed drastically in his spin off film\nApocalypse Now which also starred Vito, which took me by surprise since\nI thought he was probably too old and too dead to be fighting the\nVietnamese commies but then again he did survive a drive-by, unlike his\nsun sunshine, so I don't see why he couldn't survive a small heart\nattack so I guess it makes sense. Overall I'd say it was a good watch\nalthough I did cry when Luca Brasi died whilst swimming, not surprised\nthough he was a large chap.\n"},
{"review": "\nThis film really opened my eyes to the drama of beautiful\ncinematography and how compelling you can make an image simply with the\nframing. Having each shot tell its own story is an incredible element\ntowards crafting an excellent film. In addition to the cinematography,\nI became a huge fan of Brando because of this film. I read that he used\nsome personal techniques to craft his character and I really admire\nthat now that I am looking for ways to make my own screen-time unique\nand dynamic. I wish films would continue to use The Godfather as a\nmodel for good cinema. There is something missing from modern\nmovie-making that can be rediscovered by watching films like this.\n"},
{"review": "\nA must watch for every movie buff and specially for Fans of Al Pacino\nand Marlon Brando. The story shows how a man balances his work and\nfamily so well keeping in mind that his business is full of threat.\nCharacter of Vito Corleone defines what a real man is like and on the\nother hand Character of Michael Corleone shows how to contain anger and\nutilize it in most lethal way possible. This Story also shows how the\nmafia families have ruled the cities with both good and bad to their\ncharacters.The early life and career of Vito Corleone in 1920s New York\nis portrayed while his son, Michael, expands and tightens his grip on\nhis crime syndicate stretching from Lake Tahoe, Nevada to\npre-revolution 1958 Cuba. When the aging head of a famous crime family\ndecides to transfer his position to one of his subalterns, a series of\nunfortunate events start happening to the family, and a war begins\nbetween all the well-known families leading to insolence, deportation,\nmurder and revenge, and ends with the favorable successor being finally\nchosen.\n"}
]